[Killed] OptionalChaining
app/collaborators/collaborator-details/collaborator-details.component.ts:21:17
   form!: FormGroup;
 
   constructor() {
-    console.log(this.collaborator()?.userPeriod);
+    console.log(this.collaborator().userPeriod);
     console.log(this.collaborator()?.userPeriod._initDate);
     effect(() => {
killedBy: CollaboratorDetailsComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'userPeriod')

[Killed] OptionalChaining
app/collaborators/collaborator-details/collaborator-details.component.ts:22:17
 
   constructor() {
     console.log(this.collaborator()?.userPeriod);
-    console.log(this.collaborator()?.userPeriod._initDate);
+    console.log(this.collaborator().userPeriod._initDate);
     effect(() => {
       const collaboratorObj = this.collaborator();
killedBy: CollaboratorDetailsComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'userPeriod')

[Killed] BooleanLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:25:11
     console.log(this.collaborator()?.userPeriod._initDate);
     effect(() => {
       const collaboratorObj = this.collaborator();
-      if (!collaboratorObj) return;
+      if (collaboratorObj) return;
 
       if (!this.form) {
killedBy: AssociationsProjectCollaboratorComponent should show app-collaborator-details component when projectId and collaboratorSelected are set; CollaboratorsComponent should show collaborator details if selected collaborator; CollaboratorDetailsComponent should create
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Killed] ConditionalExpression
app/collaborators/collaborator-details/collaborator-details.component.ts:25:11
     console.log(this.collaborator()?.userPeriod._initDate);
     effect(() => {
       const collaboratorObj = this.collaborator();
-      if (!collaboratorObj) return;
+      if (true) return;
 
       if (!this.form) {
killedBy: AssociationsProjectCollaboratorComponent should show app-collaborator-details component when projectId and collaboratorSelected are set; CollaboratorsComponent should show collaborator details if selected collaborator; CollaboratorDetailsComponent should create
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Killed] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:27:23
       const collaboratorObj = this.collaborator();
       if (!collaboratorObj) return;
 
-      if (!this.form) {
-        this.form = new FormGroup<CollaboratorDetailsForm>({
-          names: new FormControl(collaboratorObj.names),
-          surnames: new FormControl(collaboratorObj.surnames),
-          email: new FormControl(collaboratorObj.email),
-          userPeriodDateTime: new FormGroup<PeriodDateTimeForm>({
-            _initDate: new FormControl(this.formatDate(collaboratorObj.userPeriod._initDate)),
-            _finalDate: new FormControl(this.formatDate(collaboratorObj.userPeriod._finalDate)),
-          }), 
-          collaboratorPeriodDateTime: new FormGroup<PeriodDateTimeForm>({
-            _initDate: new FormControl(this.formatDate(collaboratorObj.collaboratorPeriod._initDate)),
-            _finalDate: new FormControl(this.formatDate(collaboratorObj.collaboratorPeriod._finalDate)),
-          })
-        });
-      } else {
+      if (!this.form) {} else {
         this.form.patchValue({
           names: collaboratorObj.names,
killedBy: AssociationsProjectCollaboratorComponent should show app-collaborator-details component when projectId and collaboratorSelected are set; CollaboratorsComponent should show collaborator details if selected collaborator; CollaboratorDetailsComponent should create
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Killed] BooleanLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:27:11
       const collaboratorObj = this.collaborator();
       if (!collaboratorObj) return;
 
-      if (!this.form) {
+      if (this.form) {
         this.form = new FormGroup<CollaboratorDetailsForm>({
           names: new FormControl(collaboratorObj.names),
killedBy: AssociationsProjectCollaboratorComponent should show app-collaborator-details component when projectId and collaboratorSelected are set; CollaboratorsComponent should show collaborator details if selected collaborator; CollaboratorDetailsComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'patchValue')

[Killed] ObjectLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:32:65
           names: new FormControl(collaboratorObj.names),
           surnames: new FormControl(collaboratorObj.surnames),
           email: new FormControl(collaboratorObj.email),
-          userPeriodDateTime: new FormGroup<PeriodDateTimeForm>({
-            _initDate: new FormControl(this.formatDate(collaboratorObj.userPeriod._initDate)),
-            _finalDate: new FormControl(this.formatDate(collaboratorObj.userPeriod._finalDate)),
-          }), 
+          userPeriodDateTime: new FormGroup<PeriodDateTimeForm>({}), 
           collaboratorPeriodDateTime: new FormGroup<PeriodDateTimeForm>({
             _initDate: new FormControl(this.formatDate(collaboratorObj.collaboratorPeriod._initDate)),
killedBy: AssociationsProjectCollaboratorComponent should show app-collaborator-details component when projectId and collaboratorSelected are set; CollaboratorsComponent should show collaborator details if selected collaborator; CollaboratorDetailsComponent should create
statusReason: Error: Cannot find control with path: 'userPeriodDateTime -> _initDate'

[Killed] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:41:14
             _finalDate: new FormControl(this.formatDate(collaboratorObj.collaboratorPeriod._finalDate)),
           })
         });
-      } else {
-        this.form.patchValue({
-          names: collaboratorObj.names,
-          surnames: collaboratorObj.surnames,
-          email: collaboratorObj.email,
-          userPeriodDateTime: {
-            _initDate: this.formatDate(collaboratorObj.userPeriod._initDate),
-            _finalDate: this.formatDate(collaboratorObj.userPeriod._finalDate)
-          },
-          collaboratorPeriodDateTime : {
-            _initDate: this.formatDate(collaboratorObj.collaboratorPeriod._initDate),
-            _finalDate: this.formatDate(collaboratorObj.collaboratorPeriod._finalDate)
-          }
-        });
-      }
+      } else {}
     });
   }
killedBy: CollaboratorDetailsComponent should update form inputs when collaborator input changes
statusReason: Expected 'Alice' to be 'Bob'.

[Killed] ObjectLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:42:30
           })
         });
       } else {
-        this.form.patchValue({
-          names: collaboratorObj.names,
-          surnames: collaboratorObj.surnames,
-          email: collaboratorObj.email,
-          userPeriodDateTime: {
-            _initDate: this.formatDate(collaboratorObj.userPeriod._initDate),
-            _finalDate: this.formatDate(collaboratorObj.userPeriod._finalDate)
-          },
-          collaboratorPeriodDateTime : {
-            _initDate: this.formatDate(collaboratorObj.collaboratorPeriod._initDate),
-            _finalDate: this.formatDate(collaboratorObj.collaboratorPeriod._finalDate)
-          }
-        });
+        this.form.patchValue({});
       }
     });
killedBy: CollaboratorDetailsComponent should update form inputs when collaborator input changes
statusReason: Expected 'Alice' to be 'Bob'.

[Killed] ConditionalExpression
app/collaborators/collaborator-details/collaborator-details.component.ts:64:8
   }
 
   onSubmit() {
-    if(!this.form.dirty) return; 
+    if(false) return; 
 
     const formValue = this.form.value;
killedBy: CollaboratorDetailsComponent should not make any calls if form isn't dirty
statusReason: Expected spy CollaboratorSignalService.updateCollaborator to have been called 0 times. It was called 1 times.

[Killed] ConditionalExpression
app/collaborators/collaborator-details/collaborator-details.component.ts:64:8
   }
 
   onSubmit() {
-    if(!this.form.dirty) return; 
+    if(true) return; 
 
     const formValue = this.form.value;
killedBy: CollaboratorDetailsComponent should call updateCollaborator when form is submitted
statusReason: Expected spy CollaboratorSignalService.updateCollaborator to have been called only once, and with given args:
But it was never called.


Error: Expected spy CollaboratorSignalService.updateCollaborator to have been called only once, and with given args:
But it was never called.

[Killed] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:84:26
       }
     };
     this.collaboratorDataService.updateCollaborator(updatedCollaborator).subscribe({
-      next: (updated) => {
-        this.collaboratorService.updateCollaborator(updated);
-        this.collaboratorService.cancelCreateCollaborator();
-        this.form.markAsPristine();
-      },
+      next: (updated) => {},
       error: (error) => {
         console.log("Error updating collaborator: ", error)
killedBy: CollaboratorDetailsComponent should call updateCollaborator when form is submitted
statusReason: Expected spy CollaboratorSignalService.updateCollaborator to have been called only once, and with given args:
But it was never called.


Error: Expected spy CollaboratorSignalService.updateCollaborator to have been called only once, and with given args:
But it was never called.

[NoCoverage] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:89:25
         this.collaboratorService.cancelCreateCollaborator();
         this.form.markAsPristine();
       },
-      error: (error) => {
-        console.log("Error updating collaborator: ", error)
-      }
+      error: (error) => {}
     });    
   }
