[Killed] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:8:78
 import { HolidayPeriod } from './holiday-period';
 
 
-function dateRangeValidator(group: AbstractControl): ValidationErrors | null {
-  const initDate = group.get('initDate')?.value;
-  const finalDate = group.get('finalDate')?.value;
-
-  if (!initDate || !finalDate) return null;
-
-  return new Date(initDate) <= new Date(finalDate)
-    ? null
-    : { dateRangeInvalid: true };
-}
+function dateRangeValidator(group: AbstractControl): ValidationErrors | null {}
 
 
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Survived] OptionalChaining
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:9:20
 
 
 function dateRangeValidator(group: AbstractControl): ValidationErrors | null {
-  const initDate = group.get('initDate')?.value;
+  const initDate = group.get('initDate').value;
   const finalDate = group.get('finalDate')?.value;
 

[Killed] StringLiteral
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:9:30
 
 
 function dateRangeValidator(group: AbstractControl): ValidationErrors | null {
-  const initDate = group.get('initDate')?.value;
+  const initDate = group.get("")?.value;
   const finalDate = group.get('finalDate')?.value;
 
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Survived] OptionalChaining
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:10:21
 
 function dateRangeValidator(group: AbstractControl): ValidationErrors | null {
   const initDate = group.get('initDate')?.value;
-  const finalDate = group.get('finalDate')?.value;
+  const finalDate = group.get('finalDate').value;
 
   if (!initDate || !finalDate) return null;

[Killed] BooleanLiteral
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:12:20
   const initDate = group.get('initDate')?.value;
   const finalDate = group.get('finalDate')?.value;
 
-  if (!initDate || !finalDate) return null;
+  if (!initDate || finalDate) return null;
 
   return new Date(initDate) <= new Date(finalDate)
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Killed] ConditionalExpression
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:12:7
   const initDate = group.get('initDate')?.value;
   const finalDate = group.get('finalDate')?.value;
 
-  if (!initDate || !finalDate) return null;
+  if (true) return null;
 
   return new Date(initDate) <= new Date(finalDate)
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Killed] ConditionalExpression
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:14:10
 
   if (!initDate || !finalDate) return null;
 
-  return new Date(initDate) <= new Date(finalDate)
+  return true
     ? null
     : { dateRangeInvalid: true };
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Killed] EqualityOperator
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:14:10
 
   if (!initDate || !finalDate) return null;
 
-  return new Date(initDate) <= new Date(finalDate)
+  return new Date(initDate) > new Date(finalDate)
     ? null
     : { dateRangeInvalid: true };
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and form wasnt changed
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'No changes made to this holiday. ' ]
But the actual calls were:
  [ 'No changes made to this holiday. ' ],
  [ 'Final Date must be after Innit Date' ].


Error: Expected spy alert to have been called only once, and with given args:

[Survived] BooleanLiteral
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:16:27
 
   return new Date(initDate) <= new Date(finalDate)
     ? null
-    : { dateRangeInvalid: true };
+    : { dateRangeInvalid: false };
 }
 

[Killed] ArrayDeclaration
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:35:140
   collaboratorHolidays!: HolidayPeriod[];
 
   form = new FormGroup({
-    holidays: new FormArray<FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>>([])
+    holidays: new FormArray<FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>>(["Stryker was here"])
   });
 
killedBy: CollaboratorsComponent should show collaborator holidays if selected collaborator holidays; CollaboratorHolidaysComponent should create
statusReason: TypeError: control.setParent is not a function

[Timeout] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:38:17
     holidays: new FormArray<FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>>([])
   });
 
-  constructor() {
-    this.collaboratorDataService
-      .getCollaboratorHolidays(this.collaboratorHolidaysSelected()!.collabId)
-      .subscribe((holidays) => {
-        this.collaboratorHolidays = holidays
-
-        const holidayControls = this.collaboratorHolidays.map(holiday =>
-          new FormGroup({
-            initDate: new FormControl(holiday.periodDate.initDate),
-            finalDate: new FormControl(holiday.periodDate.finalDate),
-            buttonText: new FormControl("Edit")
-          },
-            { validators: dateRangeValidator }) as FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>
-        );
-
-        this.form.setControl('holidays', new FormArray(holidayControls));
-      });
-
-
-  }
+  constructor() {}
 
   get holidaysForm(): FormArray<FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>> {

[Killed] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:41:32
   constructor() {
     this.collaboratorDataService
       .getCollaboratorHolidays(this.collaboratorHolidaysSelected()!.collabId)
-      .subscribe((holidays) => {
-        this.collaboratorHolidays = holidays
-
-        const holidayControls = this.collaboratorHolidays.map(holiday =>
-          new FormGroup({
-            initDate: new FormControl(holiday.periodDate.initDate),
-            finalDate: new FormControl(holiday.periodDate.finalDate),
-            buttonText: new FormControl("Edit")
-          },
-            { validators: dateRangeValidator }) as FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>
-        );
-
-        this.form.setControl('holidays', new FormArray(holidayControls));
-      });
+      .subscribe((holidays) => {});
 
 
killedBy: CollaboratorHolidaysComponent should show the Holidays Info in the table
statusReason: TypeError: Cannot read properties of undefined (reading 'nativeElement')

[Killed] ArrowFunction
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:44:63
       .subscribe((holidays) => {
         this.collaboratorHolidays = holidays
 
-        const holidayControls = this.collaboratorHolidays.map(holiday =>
-          new FormGroup({
-            initDate: new FormControl(holiday.periodDate.initDate),
-            finalDate: new FormControl(holiday.periodDate.finalDate),
-            buttonText: new FormControl("Edit")
-          },
-            { validators: dateRangeValidator }) as FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>
+        const holidayControls = this.collaboratorHolidays.map(() => undefined
         );
 
killedBy: CollaboratorHolidaysComponent should show the Holidays Info in the table
statusReason: TypeError: Cannot read properties of undefined (reading 'nativeElement')

[Killed] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:59:144
 
   }
 
-  get holidaysForm(): FormArray<FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>> {
-    return this.form.get('holidays') as FormArray;
-  }
+  get holidaysForm(): FormArray<FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>> {}
 
   private formatDate(date: string): string {
killedBy: CollaboratorsComponent should show collaborator holidays if selected collaborator holidays; CollaboratorHolidaysComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'controls')

[Survived] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:63:44
     return this.form.get('holidays') as FormArray;
   }
 
-  private formatDate(date: string): string {
-    return new Date(date).toISOString().split('T')[0];
-  }
+  private formatDate(date: string): string {}
 
   editHoliday(index: number) {

[Killed] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:68:27
   }
 
   editHoliday(index: number) {
-    if (!this.form.dirty) {
-      window.alert("No changes made to this holiday. ");
-    }
+    if (!this.form.dirty) {}
     if(this.holidaysForm.length == 0) {
       
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and form wasnt changed
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'No changes made to this holiday. ' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'No changes made to this holiday. ' ]
But it was never called.

[Killed] BooleanLiteral
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:68:9
   }
 
   editHoliday(index: number) {
-    if (!this.form.dirty) {
+    if (this.form.dirty) {
       window.alert("No changes made to this holiday. ");
     }
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and form wasnt changed
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'No changes made to this holiday. ' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'No changes made to this holiday. ' ]
But it was never called.

[Killed] ConditionalExpression
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:71:8
     if (!this.form.dirty) {
       window.alert("No changes made to this holiday. ");
     }
-    if(this.holidaysForm.length == 0) {
+    if(true) {
       
     } else {
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Killed] EqualityOperator
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:71:8
     if (!this.form.dirty) {
       window.alert("No changes made to this holiday. ");
     }
-    if(this.holidaysForm.length == 0) {
+    if(this.holidaysForm.length != 0) {
       
     } else {
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Killed] ConditionalExpression
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:75:11
       
     } else {
       const holidayGroup = this.holidaysForm.at(index);
-      if (holidayGroup.valid) {
+      if (true) {
         if (index >= this.collaboratorHolidays.length) {
           this.collaboratorDataService.addHoliday(this.collaboratorHolidaysSelected()!.collabId,
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Killed] ConditionalExpression
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:75:11
       
     } else {
       const holidayGroup = this.holidaysForm.at(index);
-      if (holidayGroup.valid) {
+      if (false) {
         if (index >= this.collaboratorHolidays.length) {
           this.collaboratorDataService.addHoliday(this.collaboratorHolidaysSelected()!.collabId,
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and form wasnt changed
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'No changes made to this holiday. ' ]
But the actual calls were:
  [ 'No changes made to this holiday. ' ],
  [ 'Final Date must be after Innit Date' ].


Error: Expected spy alert to have been called only once, and with given args:

[Killed] EqualityOperator
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:76:13
     } else {
       const holidayGroup = this.holidaysForm.at(index);
       if (holidayGroup.valid) {
-        if (index >= this.collaboratorHolidays.length) {
+        if (index < this.collaboratorHolidays.length) {
           this.collaboratorDataService.addHoliday(this.collaboratorHolidaysSelected()!.collabId,
             holidayGroup.value.initDate!,
killedBy: CollaboratorHolidaysComponent should call dataService.editHoliday when edit button is pressed and form was altered
statusReason: Expected spy CollaboratorDataService.editHoliday to have been called.

[Killed] ConditionalExpression
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:76:13
     } else {
       const holidayGroup = this.holidaysForm.at(index);
       if (holidayGroup.valid) {
-        if (index >= this.collaboratorHolidays.length) {
+        if (true) {
           this.collaboratorDataService.addHoliday(this.collaboratorHolidaysSelected()!.collabId,
             holidayGroup.value.initDate!,
killedBy: CollaboratorHolidaysComponent should call dataService.editHoliday when edit button is pressed and form was altered
statusReason: Expected spy CollaboratorDataService.editHoliday to have been called.

[NoCoverage] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:81:26
             holidayGroup.value.initDate!,
             holidayGroup.value.finalDate!)
             .subscribe({
-              next: h => {
-                holidayGroup.get('buttonText')?.setValue("Edit"),
-                  console.log(h);
-              },
+              next: h => {},
               error: e => {
                 console.log(e);

[NoCoverage] OptionalChaining
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:82:17
             holidayGroup.value.finalDate!)
             .subscribe({
               next: h => {
-                holidayGroup.get('buttonText')?.setValue("Edit"),
+                holidayGroup.get('buttonText').setValue("Edit"),
                   console.log(h);
               },

[NoCoverage] StringLiteral
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:82:34
             holidayGroup.value.finalDate!)
             .subscribe({
               next: h => {
-                holidayGroup.get('buttonText')?.setValue("Edit"),
+                holidayGroup.get("")?.setValue("Edit"),
                   console.log(h);
               },

[NoCoverage] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:85:27
                 holidayGroup.get('buttonText')?.setValue("Edit"),
                   console.log(h);
               },
-              error: e => {
-                console.log(e);
-              }
+              error: e => {}
             });
         }

[Killed] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:90:14
               }
             });
         }
-        else {
-          const updatedHoliday: HolidayPeriod = {
-            id: this.collaboratorHolidays[index].id,
-            periodDate: {
-              initDate: this.formatDate(holidayGroup.get('initDate')!.value),
-              finalDate: this.formatDate(holidayGroup.get('finalDate')!.value)
-            }
-          }
-
-          this.collaboratorDataService.editHoliday(this.collaboratorHolidaysSelected()!.collabId, updatedHoliday).subscribe(h => console.log(h));
-          this.form.markAsPristine();
-        }
+        else {}
       } else {
         window.alert("Final Date must be after Innit Date");
killedBy: CollaboratorHolidaysComponent should call dataService.editHoliday when edit button is pressed and form was altered
statusReason: Expected spy CollaboratorDataService.editHoliday to have been called.

[Survived] ObjectLiteral
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:91:49
             });
         }
         else {
-          const updatedHoliday: HolidayPeriod = {
-            id: this.collaboratorHolidays[index].id,
-            periodDate: {
-              initDate: this.formatDate(holidayGroup.get('initDate')!.value),
-              finalDate: this.formatDate(holidayGroup.get('finalDate')!.value)
-            }
-          }
+          const updatedHoliday: HolidayPeriod = {}
 
           this.collaboratorDataService.editHoliday(this.collaboratorHolidaysSelected()!.collabId, updatedHoliday).subscribe(h => console.log(h));

[Survived] ObjectLiteral
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:93:25
         else {
           const updatedHoliday: HolidayPeriod = {
             id: this.collaboratorHolidays[index].id,
-            periodDate: {
-              initDate: this.formatDate(holidayGroup.get('initDate')!.value),
-              finalDate: this.formatDate(holidayGroup.get('finalDate')!.value)
-            }
+            periodDate: {}
           }
 

[NoCoverage] ArrowFunction
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:99:125
             }
           }
 
-          this.collaboratorDataService.editHoliday(this.collaboratorHolidaysSelected()!.collabId, updatedHoliday).subscribe(h => console.log(h));
+          this.collaboratorDataService.editHoliday(this.collaboratorHolidaysSelected()!.collabId, updatedHoliday).subscribe(() => undefined);
           this.form.markAsPristine();
         }

[Killed] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:102:14
           this.collaboratorDataService.editHoliday(this.collaboratorHolidaysSelected()!.collabId, updatedHoliday).subscribe(h => console.log(h));
           this.form.markAsPristine();
         }
-      } else {
-        window.alert("Final Date must be after Innit Date");
-      }
+      } else {}
     }
   }
killedBy: CollaboratorHolidaysComponent should call window.alert when edit button is pressed and init date is after final date
statusReason: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.


Error: Expected spy alert to have been called only once, and with given args:
  [ 'Final Date must be after Innit Date' ]
But it was never called.

[Killed] BlockStatement
app/collaborators/collaborator-holidays/collaborator-holidays.component.ts:108:24
     }
   }
 
-  createEmptyHoliday() {
-    this.holidaysForm.push(
-      new FormGroup({
-        initDate: new FormControl(this.formatDate(new Date().toDateString())),
-        finalDate: new FormControl(this.formatDate(new Date().toDateString())),
-        buttonText: new FormControl("Save")
-      }, { validators: dateRangeValidator }) as FormGroup<{ initDate: FormControl<string>, finalDate: FormControl<string>, buttonText: FormControl<string> }>
-    );
-  }
+  createEmptyHoliday() {}
 }
 
killedBy: CollaboratorHolidaysComponent when createEmptyHoliday is called a new element is added to the form
statusReason: Expected 2 to be 3.
