[Survived] BooleanLiteral
src/app/collaborators/collaborator-signal.service.ts:23:49
   private selectedCollaboratorProjectsSignal = signal<Collaborator | undefined>(undefined);
   readonly selectedCollaboratorProjects = this.selectedCollaboratorProjectsSignal.asReadonly();
 
-  private isCreatingCollaboratorSignal = signal(false);
+  private isCreatingCollaboratorSignal = signal(true);
   readonly isCreatingCollaborator = this.isCreatingCollaboratorSignal.asReadonly();
   

[Timeout] BlockStatement
src/app/collaborators/collaborator-signal.service.ts:29:45
   private createdCollaboratorSignal = signal<Collaborator  | undefined>(undefined);
   readonly createdCollaborator = this.createdCollaboratorSignal.asReadonly();
 
-  updateCollaborator(updated: Collaborator) {
-    this.updateCollaboratorSignal.set(updated);
-  }
+  updateCollaborator(updated: Collaborator) {}
 
   startCreateCollaborator() {

[Killed] BlockStatement
src/app/collaborators/collaborator-signal.service.ts:33:29
     this.updateCollaboratorSignal.set(updated);
   }
 
-  startCreateCollaborator() {
-    this.isCreatingCollaboratorSignal.set(true);
-  }
+  startCreateCollaborator() {}
 
   createCollaborator(create: Collaborator) {
killedBy: CollaboratorService should set isCreatingCollaborator to true when startCreateCollaborator is called
statusReason: Expected false to be true.

[Killed] BooleanLiteral
src/app/collaborators/collaborator-signal.service.ts:34:43
   }
 
   startCreateCollaborator() {
-    this.isCreatingCollaboratorSignal.set(true);
+    this.isCreatingCollaboratorSignal.set(false);
   }
 
killedBy: CollaboratorService should set isCreatingCollaborator to true when startCreateCollaborator is called
statusReason: Expected false to be true.

[NoCoverage] BlockStatement
src/app/collaborators/collaborator-signal.service.ts:37:44
     this.isCreatingCollaboratorSignal.set(true);
   }
 
-  createCollaborator(create: Collaborator) {
-    this.createdCollaboratorSignal.set(create)
-  }
+  createCollaborator(create: Collaborator) {}
 
   cancelCreateCollaborator() {

[Survived] BlockStatement
src/app/collaborators/collaborator-signal.service.ts:41:30
     this.createdCollaboratorSignal.set(create)
   }
 
-  cancelCreateCollaborator() {
-    this.isCreatingCollaboratorSignal.set(false);
-  }
+  cancelCreateCollaborator() {}
 
   selectCollaborator(selected: Collaborator | undefined){

[Killed] BooleanLiteral
src/app/collaborators/collaborator-signal.service.ts:42:43
   }
 
   cancelCreateCollaborator() {
-    this.isCreatingCollaboratorSignal.set(false);
+    this.isCreatingCollaboratorSignal.set(true);
   }
 
killedBy: CollaboratorService should set isCreatingCollaborator to false when cancelCreateCollaborator is called
statusReason: Expected true to be false.

[Killed] BlockStatement
src/app/collaborators/collaborator-signal.service.ts:45:57
     this.isCreatingCollaboratorSignal.set(false);
   }
 
-  selectCollaborator(selected: Collaborator | undefined){
-    this.selectedCollaboratorHolidaysSignal.set(undefined);
-    this.selectedCollaboratorProjectsSignal.set(undefined);
-    this.selectedCollaboratorSignal.set(selected);
-  }
+  selectCollaborator(selected: Collaborator | undefined){}
 
   selectCollaboratorHolidays(selected: Collaborator | undefined){
killedBy: CollaboratorService should set selectedCollaborator when selectCollaborator is called

[Killed] BlockStatement
src/app/collaborators/collaborator-signal.service.ts:51:65
     this.selectedCollaboratorSignal.set(selected);
   }
 
-  selectCollaboratorHolidays(selected: Collaborator | undefined){
-    this.selectedCollaboratorSignal.set(undefined);
-    this.selectedCollaboratorProjectsSignal.set(undefined);
-    this.selectedCollaboratorHolidaysSignal.set(selected);
-  }
+  selectCollaboratorHolidays(selected: Collaborator | undefined){}
 
   selectCollaboratorProjects(selected: Collaborator | undefined){
killedBy: CollaboratorService should set selectedCollaboratorHoliday when selectCollaboratorHolidays is called

[Killed] BlockStatement
src/app/collaborators/collaborator-signal.service.ts:57:65
     this.selectedCollaboratorHolidaysSignal.set(selected);
   }
 
-  selectCollaboratorProjects(selected: Collaborator | undefined){
-    this.selectedCollaboratorSignal.set(undefined);
-    this.selectedCollaboratorHolidaysSignal.set(undefined);
-    this.selectedCollaboratorProjectsSignal.set(selected);
-  }
+  selectCollaboratorProjects(selected: Collaborator | undefined){}
 }
 
killedBy: CollaboratorService should set selectedCollaboratorProjects when selectCollaboratorProjects is called
