[NoCoverage] BlockStatement
app/collaborators/collaborators-bullets/collaborators-bullets.component.ts:16:51
 
   collaboratorSignalService = inject(CollaboratorSignalService);
 
-  onSelectCollaborator(collaborator: Collaborator){
-    this.collaboratorSignalService.selectCollaborator(collaborator);
-  }
+  onSelectCollaborator(collaborator: Collaborator){}
 }
 
