[Killed] ObjectLiteral
src/app/collaborators/collaborators.component.ts:41:57
   collaborators = signal<Collaborator[]>([]);
 
   constructor() {
-    this.collaboratorDataService.getCollabs().subscribe({
-      next: (collaborators) => {
-        this.collaborators.set(collaborators);
-      },
-      error: (err) => {
-        alert('Error loading collaborators');
-        console.error('Error loading collaborators', err);
-      }
-    });
+    this.collaboratorDataService.getCollabs().subscribe({});
 
     this.collaboratorSignalService.selectCollaborator(undefined);
killedBy: CollaboratorsComponent should load collaborators on initialization
statusReason: Expected $.length = 0 to equal 2.

[Killed] BlockStatement
src/app/collaborators/collaborators.component.ts:42:32
 
   constructor() {
     this.collaboratorDataService.getCollabs().subscribe({
-      next: (collaborators) => {
-        this.collaborators.set(collaborators);
-      },
+      next: (collaborators) => {},
       error: (err) => {
         alert('Error loading collaborators');
killedBy: CollaboratorsComponent should load collaborators on initialization
statusReason: Expected $.length = 0 to equal 2.

[Killed] BlockStatement
src/app/collaborators/collaborators.component.ts:45:23
       next: (collaborators) => {
         this.collaborators.set(collaborators);
       },
-      error: (err) => {
-        alert('Error loading collaborators');
-        console.error('Error loading collaborators', err);
-      }
+      error: (err) => {}
     });
 
killedBy: CollaboratorsComponent should handle error when loading collaborators fails
statusReason: Expected spy alert to have been called with:
  [ 'Error loading collaborators' ]
but it was never called.

[Killed] StringLiteral
src/app/collaborators/collaborators.component.ts:46:15
         this.collaborators.set(collaborators);
       },
       error: (err) => {
-        alert('Error loading collaborators');
+        alert("");
         console.error('Error loading collaborators', err);
       }
killedBy: CollaboratorsComponent should handle error when loading collaborators fails
statusReason: Expected spy alert to have been called with:
  [ 'Error loading collaborators' ]
but actual calls were:
  [ '' ].

Call 0:
  Expected $[0] = '' to equal 'Error loading collaborators'.
Error: Expected spy alert to have been called with:

[Timeout] BlockStatement
src/app/collaborators/collaborators.component.ts:55:18
     this.collaboratorSignalService.selectCollaboratorHolidays(undefined);
 
 
-    effect(() => {
-      const updated = this.collaboratorUpdated();
-      if (updated) {
-        this.collaborators.update(collabs =>
-          collabs.map(c => c.collabId === updated.collabId ? updated : c)
-        )
-      }
-    });
+    effect(() => {});
 
     effect(() => {

[Killed] ConditionalExpression
src/app/collaborators/collaborators.component.ts:57:11
 
     effect(() => {
       const updated = this.collaboratorUpdated();
-      if (updated) {
+      if (true) {
         this.collaborators.update(collabs =>
           collabs.map(c => c.collabId === updated.collabId ? updated : c)
killedBy: CollaboratorsComponent should load collaborators on initialization
statusReason: TypeError: Cannot read properties of undefined (reading 'collabId')

[Killed] BlockStatement
src/app/collaborators/collaborators.component.ts:57:20
 
     effect(() => {
       const updated = this.collaboratorUpdated();
-      if (updated) {
-        this.collaborators.update(collabs =>
-          collabs.map(c => c.collabId === updated.collabId ? updated : c)
-        )
-      }
+      if (updated) {}
     });
 
killedBy: CollaboratorsComponent should update collaborator when collaboratorUpdated signal changes
statusReason: Expected 'John' to be 'New Name'.

[Killed] ArrowFunction
src/app/collaborators/collaborators.component.ts:58:35
     effect(() => {
       const updated = this.collaboratorUpdated();
       if (updated) {
-        this.collaborators.update(collabs =>
-          collabs.map(c => c.collabId === updated.collabId ? updated : c)
+        this.collaborators.update(() => undefined
         )
       }
killedBy: CollaboratorsComponent should update collaborator when collaboratorUpdated signal changes
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Killed] EqualityOperator
src/app/collaborators/collaborators.component.ts:59:28
       const updated = this.collaboratorUpdated();
       if (updated) {
         this.collaborators.update(collabs =>
-          collabs.map(c => c.collabId === updated.collabId ? updated : c)
+          collabs.map(c => c.collabId !== updated.collabId ? updated : c)
         )
       }
killedBy: CollaboratorsComponent should update collaborator when collaboratorUpdated signal changes
statusReason: Expected 'John' to be 'New Name'.

[Killed] ArrowFunction
src/app/collaborators/collaborators.component.ts:59:23
       const updated = this.collaboratorUpdated();
       if (updated) {
         this.collaborators.update(collabs =>
-          collabs.map(c => c.collabId === updated.collabId ? updated : c)
+          collabs.map(() => undefined)
         )
       }
killedBy: CollaboratorsComponent should update collaborator when collaboratorUpdated signal changes
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Survived] BlockStatement
src/app/collaborators/collaborators.component.ts:64:18
       }
     });
 
-    effect(() => {
-      const created = this.createdCollaborator();
-      if (created) {
-        this.collaborators.update(collabs => [...collabs, created]);
-      }
-    })
+    effect(() => {})
   }
 

[Killed] ConditionalExpression
src/app/collaborators/collaborators.component.ts:66:11
 
     effect(() => {
       const created = this.createdCollaborator();
-      if (created) {
+      if (true) {
         this.collaborators.update(collabs => [...collabs, created]);
       }
killedBy: AppComponent should request collaborators after 'Collaborators' button in the header is clicked; CollaboratorsComponent should load collaborators on initialization
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[NoCoverage] BlockStatement
src/app/collaborators/collaborators.component.ts:66:20
 
     effect(() => {
       const created = this.createdCollaborator();
-      if (created) {
-        this.collaborators.update(collabs => [...collabs, created]);
-      }
+      if (created) {}
     })
   }

[NoCoverage] ArrowFunction
src/app/collaborators/collaborators.component.ts:67:35
     effect(() => {
       const created = this.createdCollaborator();
       if (created) {
-        this.collaborators.update(collabs => [...collabs, created]);
+        this.collaborators.update(() => undefined);
       }
     })

[NoCoverage] ArrayDeclaration
src/app/collaborators/collaborators.component.ts:67:46
     effect(() => {
       const created = this.createdCollaborator();
       if (created) {
-        this.collaborators.update(collabs => [...collabs, created]);
+        this.collaborators.update(collabs => []);
       }
     })

[Killed] BlockStatement
src/app/collaborators/collaborators.component.ts:72:17
     })
   }
 
-  startCreate() {
-    this.collaboratorSignalService.startCreateCollaborator();
-  }
+  startCreate() {}
 }
killedBy: CollaboratorsComponent should call signal service startCreateCollaborator in startCreate method
statusReason: Expected spy CollaboratorSignalService.startCreateCollaborator to have been called.
