[Killed] ObjectLiteral
app/projects/create-project/create-project.component.ts:18:26
     projectSignalService = inject(ProjectsSignalsService);
     projectDataService = inject(ProjectsDataService);
 
-    form = new FormGroup({
-        title: new FormControl<string>('', [
-            Validators.required,
-            Validators.maxLength(50),
-            Validators.minLength(1)
-        ]),
-        acronym: new FormControl<string>('', [
-            Validators.required,
-            Validators.pattern(/^[A-Z0-9]{1,10}$/)
-        ]),
-        periodDate: new FormGroup({
-            initDate: new FormControl<string>(this.formatDate(new Date()), Validators.required),
-            finalDate: new FormControl<string>(this.formatDate(new Date()), Validators.required),
-        }, { validators: this.dateRangeValidator() }),
-    });
+    form = new FormGroup({});
 
     private formatDate(date: Date): string {
killedBy: ProjectCreateComponent should be created
statusReason: Error: Cannot find control with name: 'title'

[Killed] Regex
app/projects/create-project/create-project.component.ts:26:32
         ]),
         acronym: new FormControl<string>('', [
             Validators.required,
-            Validators.pattern(/^[A-Z0-9]{1,10}$/)
+            Validators.pattern(/^[^A-Z0-9]{1,10}$/)
         ]),
         periodDate: new FormGroup({
killedBy: ProjectCreateComponent should mark as invalid if acronym has lowercase letters
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] Regex
app/projects/create-project/create-project.component.ts:26:32
         ]),
         acronym: new FormControl<string>('', [
             Validators.required,
-            Validators.pattern(/^[A-Z0-9]{1,10}$/)
+            Validators.pattern(/^[A-Z0-9]{1,10}/)
         ]),
         periodDate: new FormGroup({
killedBy: ProjectCreateComponent should mark as invalid if acronym has size bigger than 10
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ObjectLiteral
app/projects/create-project/create-project.component.ts:28:35
             Validators.required,
             Validators.pattern(/^[A-Z0-9]{1,10}$/)
         ]),
-        periodDate: new FormGroup({
-            initDate: new FormControl<string>(this.formatDate(new Date()), Validators.required),
-            finalDate: new FormControl<string>(this.formatDate(new Date()), Validators.required),
-        }, { validators: this.dateRangeValidator() }),
+        periodDate: new FormGroup({}, { validators: this.dateRangeValidator() }),
     });
 
killedBy: ProjectCreateComponent should be created
statusReason: Error: Cannot find control with path: 'periodDate -> initDate'

[Killed] BlockStatement
app/projects/create-project/create-project.component.ts:34:44
         }, { validators: this.dateRangeValidator() }),
     });
 
-    private formatDate(date: Date): string {
-        return date.toISOString().split('T')[0];
-    }
+    private formatDate(date: Date): string {}
 
     dateRangeValidator(): ValidatorFn {
killedBy: ProjectCreateComponent should create form with default empty values
statusReason: Expected null to be '2025-06-03'.

[Killed] BlockStatement
app/projects/create-project/create-project.component.ts:38:39
         return date.toISOString().split('T')[0];
     }
 
-    dateRangeValidator(): ValidatorFn {
-        return (group: AbstractControl): ValidationErrors | null => {
-            const init = group.get('initDate')?.value;
-            const final = group.get('finalDate')?.value;
-
-            if (!init || !final) return null; // Don't validate if either date is missing
-
-            const initDate = new Date(init);
-            const finalDate = new Date(final);
-
-            return initDate < finalDate ? null : { dateRangeInvalid: true };
-        };
-    }
+    dateRangeValidator(): ValidatorFn {}
 
     onSubmit() {
killedBy: ProjectCreateComponent should mark as invalid if period's initial date is after final date
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
app/projects/create-project/create-project.component.ts:39:69
     }
 
     dateRangeValidator(): ValidatorFn {
-        return (group: AbstractControl): ValidationErrors | null => {
-            const init = group.get('initDate')?.value;
-            const final = group.get('finalDate')?.value;
-
-            if (!init || !final) return null; // Don't validate if either date is missing
-
-            const initDate = new Date(init);
-            const finalDate = new Date(final);
-
-            return initDate < finalDate ? null : { dateRangeInvalid: true };
-        };
+        return (group: AbstractControl): ValidationErrors | null => {};
     }
 
killedBy: ProjectCreateComponent should mark as invalid if period's initial date is after final date
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Survived] OptionalChaining
app/projects/create-project/create-project.component.ts:40:26
 
     dateRangeValidator(): ValidatorFn {
         return (group: AbstractControl): ValidationErrors | null => {
-            const init = group.get('initDate')?.value;
+            const init = group.get('initDate').value;
             const final = group.get('finalDate')?.value;
 

[Survived] OptionalChaining
app/projects/create-project/create-project.component.ts:41:27
     dateRangeValidator(): ValidatorFn {
         return (group: AbstractControl): ValidationErrors | null => {
             const init = group.get('initDate')?.value;
-            const final = group.get('finalDate')?.value;
+            const final = group.get('finalDate').value;
 
             if (!init || !final) return null; // Don't validate if either date is missing

[Killed] StringLiteral
app/projects/create-project/create-project.component.ts:41:37
     dateRangeValidator(): ValidatorFn {
         return (group: AbstractControl): ValidationErrors | null => {
             const init = group.get('initDate')?.value;
-            const final = group.get('finalDate')?.value;
+            const final = group.get("")?.value;
 
             if (!init || !final) return null; // Don't validate if either date is missing
killedBy: ProjectCreateComponent should mark as invalid if period's initial date is after final date
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
app/projects/create-project/create-project.component.ts:43:17
             const init = group.get('initDate')?.value;
             const final = group.get('finalDate')?.value;
 
-            if (!init || !final) return null; // Don't validate if either date is missing
+            if (init || !final) return null; // Don't validate if either date is missing
 
             const initDate = new Date(init);
killedBy: ProjectCreateComponent should mark as invalid if period's initial date is after final date
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ConditionalExpression
app/projects/create-project/create-project.component.ts:43:17
             const init = group.get('initDate')?.value;
             const final = group.get('finalDate')?.value;
 
-            if (!init || !final) return null; // Don't validate if either date is missing
+            if (true) return null; // Don't validate if either date is missing
 
             const initDate = new Date(init);
killedBy: ProjectCreateComponent should mark as invalid if period's initial date is after final date
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
app/projects/create-project/create-project.component.ts:48:70
             const initDate = new Date(init);
             const finalDate = new Date(final);
 
-            return initDate < finalDate ? null : { dateRangeInvalid: true };
+            return initDate < finalDate ? null : { dateRangeInvalid: false };
         };
     }
killedBy: ProjectCreateComponent should mark as invalid if period's initial date is after final date
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/projects/create-project/create-project.component.ts:48:20
             const initDate = new Date(init);
             const finalDate = new Date(final);
 
-            return initDate < finalDate ? null : { dateRangeInvalid: true };
+            return false ? null : { dateRangeInvalid: true };
         };
     }
killedBy: ProjectCreateComponent should log the form value on submit if valid
statusReason: Expected spy ProjectsDataService.createProject to have been called only once, and with given args:
  [ Object({ title: 'Test', acronym: 'TEST', periodDate: Object({ initDate: '2025-10-01', finalDate: '2025-12-01' }) }) ]
But it was never called.


Error: Expected spy ProjectsDataService.createProject to have been called only once, and with given args:
  [ Object({ title: 'Test', acronym: 'TEST', p

[Killed] BlockStatement
app/projects/create-project/create-project.component.ts:53:32
     }
 
     onSubmit() {
-        if (this.form.invalid) {
-            this.form.markAllAsTouched();
-            return;
-        }
+        if (this.form.invalid) {}
 
         const formValue = this.form.getRawValue();
killedBy: ProjectCreateComponent should mark as invalid if title has size bigger than 50
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ConditionalExpression
app/projects/create-project/create-project.component.ts:53:13
     }
 
     onSubmit() {
-        if (this.form.invalid) {
+        if (false) {
             this.form.markAllAsTouched();
             return;
killedBy: ProjectCreateComponent should mark as invalid if title has size bigger than 50
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ObjectLiteral
app/projects/create-project/create-project.component.ts:60:50
 
         const formValue = this.form.getRawValue();
 
-        const newProject: ProjectCreateRequest = {
-            title: formValue.title ?? '',
-            acronym: formValue.acronym ?? '',
-            periodDate: {
-                initDate: formValue.periodDate!.initDate!,
-                finalDate: formValue.periodDate!.finalDate!
-            }
-        };
+        const newProject: ProjectCreateRequest = {};
 
         this.projectDataService.createProject(newProject).subscribe({
killedBy: ProjectCreateComponent should log the form value on submit if valid
statusReason: Expected spy ProjectsDataService.createProject to have been called only once, and with given args:
  [ Object({ title: 'Test', acronym: 'TEST', periodDate: Object({ initDate: '2025-10-01', finalDate: '2025-12-01' }) }) ]
But the actual call was:
  [ Object({  }) ].
Expected $[0] to have properties
    title: 'Test'
    acronym: 'TEST'
    periodDate: Object({ initDate: '2025-10-01', finalDate: '20

[Killed] LogicalOperator
app/projects/create-project/create-project.component.ts:61:20
         const formValue = this.form.getRawValue();
 
         const newProject: ProjectCreateRequest = {
-            title: formValue.title ?? '',
+            title: formValue.title && '',
             acronym: formValue.acronym ?? '',
             periodDate: {
killedBy: ProjectCreateComponent should log the form value on submit if valid
statusReason: Expected spy ProjectsDataService.createProject to have been called only once, and with given args:
  [ Object({ title: 'Test', acronym: 'TEST', periodDate: Object({ initDate: '2025-10-01', finalDate: '2025-12-01' }) }) ]
But the actual call was:
  [ Object({ title: '', acronym: 'TEST', periodDate: Object({ initDate: '2025-10-01', finalDate: '2025-12-01' }) }) ].
Expected $[0].title = '' to equal '

[NoCoverage] StringLiteral
app/projects/create-project/create-project.component.ts:61:39
         const formValue = this.form.getRawValue();
 
         const newProject: ProjectCreateRequest = {
-            title: formValue.title ?? '',
+            title: formValue.title ?? "Stryker was here!",
             acronym: formValue.acronym ?? '',
             periodDate: {

[Killed] LogicalOperator
app/projects/create-project/create-project.component.ts:62:22
 
         const newProject: ProjectCreateRequest = {
             title: formValue.title ?? '',
-            acronym: formValue.acronym ?? '',
+            acronym: formValue.acronym && '',
             periodDate: {
                 initDate: formValue.periodDate!.initDate!,
killedBy: ProjectCreateComponent should log the form value on submit if valid
statusReason: Expected spy ProjectsDataService.createProject to have been called only once, and with given args:
  [ Object({ title: 'Test', acronym: 'TEST', periodDate: Object({ initDate: '2025-10-01', finalDate: '2025-12-01' }) }) ]
But the actual call was:
  [ Object({ title: 'Test', acronym: '', periodDate: Object({ initDate: '2025-10-01', finalDate: '2025-12-01' }) }) ].
Expected $[0].acronym = '' to equal

[NoCoverage] StringLiteral
app/projects/create-project/create-project.component.ts:62:43
 
         const newProject: ProjectCreateRequest = {
             title: formValue.title ?? '',
-            acronym: formValue.acronym ?? '',
+            acronym: formValue.acronym ?? "Stryker was here!",
             periodDate: {
                 initDate: formValue.periodDate!.initDate!,

[NoCoverage] BlockStatement
app/projects/create-project/create-project.component.ts:70:39
         };
 
         this.projectDataService.createProject(newProject).subscribe({
-            next: (createdProject) => {
-                console.log('Created project:', createdProject);
-                this.projectSignalService.cancelCreateProject();
-                this.projectSignalService.createProject(createdProject);
-                this.form.reset();
-            },
+            next: (createdProject) => {},
             error: (error) => {
                 console.error('Error creating project:', error);

[NoCoverage] BlockStatement
app/projects/create-project/create-project.component.ts:76:31
                 this.projectSignalService.createProject(createdProject);
                 this.form.reset();
             },
-            error: (error) => {
-                console.error('Error creating project:', error);
-            }
+            error: (error) => {}
         });
     }

[NoCoverage] StringLiteral
app/projects/create-project/create-project.component.ts:77:31
                 this.form.reset();
             },
             error: (error) => {
-                console.error('Error creating project:', error);
+                console.error("", error);
             }
         });

[Killed] BlockStatement
app/projects/create-project/create-project.component.ts:82:16
         });
     }
 
-    onCancel() {
-        this.projectSignalService.cancelCreateProject();
-        this.form.reset();
-    }
+    onCancel() {}
 
     get title() {
killedBy: ProjectCreateComponent should reset form and call cancelCreateProject on cancel
statusReason: Expected spy ProjectsSignalsService.cancelCreateProject to have been called.

[Killed] BlockStatement
app/projects/create-project/create-project.component.ts:87:17
         this.form.reset();
     }
 
-    get title() {
-        return this.form.get('title') as FormControl;
-    }
+    get title() {}
 
     get acronym() {
killedBy: ProjectCreateComponent should be created
statusReason: TypeError: Cannot read properties of undefined (reading 'touched')

[Killed] BlockStatement
app/projects/create-project/create-project.component.ts:91:19
         return this.form.get('title') as FormControl;
     }
 
-    get acronym() {
-        return this.form.get('acronym') as FormControl;
-    }
+    get acronym() {}
 }
 
killedBy: ProjectCreateComponent should be created
statusReason: TypeError: Cannot read properties of undefined (reading 'touched')
