[Killed] BlockStatement
src/app/projects/projects-data.service.ts:17:40
   constructor(private http: HttpClient) {
   }
 
-  getProjects(): Observable<Project[]> {
-    return this.http.get<Project[]>(`${this.baseUrl}/Project`)
-  }
+  getProjects(): Observable<Project[]> {}
 
   getProjectById(id: string): Observable<Project> {
killedBy: AppComponent should request projects after 'Projects' button in the header is clicked; ProjectsDataService should fetch all projects
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/projects/projects-data.service.ts:21:51
     return this.http.get<Project[]>(`${this.baseUrl}/Project`)
   }
 
-  getProjectById(id: string): Observable<Project> {
-    return this.http.get<Project>(`${this.baseUrl}/Project/${id}`);
-  }
+  getProjectById(id: string): Observable<Project> {}
 
   getAssociations(id: string): Observable<AssociationProjectCollaborators[]> {
killedBy: ProjectsDataService should fetch project by id
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[NoCoverage] BlockStatement
src/app/projects/projects-data.service.ts:25:78
     return this.http.get<Project>(`${this.baseUrl}/Project/${id}`);
   }
 
-  getAssociations(id: string): Observable<AssociationProjectCollaborators[]> {
-    return this.http.get<AssociationProjectCollaborators[]>(`${this.baseUrl}/Project/${id}/associations`);
-  }
+  getAssociations(id: string): Observable<AssociationProjectCollaborators[]> {}
 
   createProject(newProject: ProjectCreateRequest): Observable<Project> {

[NoCoverage] StringLiteral
src/app/projects/projects-data.service.ts:26:61
   }
 
   getAssociations(id: string): Observable<AssociationProjectCollaborators[]> {
-    return this.http.get<AssociationProjectCollaborators[]>(`${this.baseUrl}/Project/${id}/associations`);
+    return this.http.get<AssociationProjectCollaborators[]>(``);
   }
 

[NoCoverage] BlockStatement
src/app/projects/projects-data.service.ts:29:72
     return this.http.get<AssociationProjectCollaborators[]>(`${this.baseUrl}/Project/${id}/associations`);
   }
 
-  createProject(newProject: ProjectCreateRequest): Observable<Project> {
-    return this.http.post<Project>(`${this.baseUrl}/Project`, newProject);
-  }
+  createProject(newProject: ProjectCreateRequest): Observable<Project> {}
 }
 
