[Survived] BooleanLiteral
src/app/projects/projects-signals.service.ts:13:44
 
   private projectCollaboratorsSelectedSignal = signal<Project | undefined>(undefined);
   readonly projectCollaboratorSelected = this.projectCollaboratorsSelectedSignal.asReadonly();
-  private isCreatingProjectSignal = signal(false);
+  private isCreatingProjectSignal = signal(true);
   readonly isCreatingProject = this.isCreatingProjectSignal.asReadonly();
 

[NoCoverage] BlockStatement
src/app/projects/projects-signals.service.ts:19:24
   private projectCreatedSignal = signal<Project | undefined>(undefined);
   readonly projectCreated = this.projectCreatedSignal.asReadonly();
 
-  startCreateProject() {
-    this.isCreatingProjectSignal.set(true);
-  }
+  startCreateProject() {}
 
   cancelCreateProject() {

[NoCoverage] BooleanLiteral
src/app/projects/projects-signals.service.ts:20:38
   readonly projectCreated = this.projectCreatedSignal.asReadonly();
 
   startCreateProject() {
-    this.isCreatingProjectSignal.set(true);
+    this.isCreatingProjectSignal.set(false);
   }
 

[NoCoverage] BlockStatement
src/app/projects/projects-signals.service.ts:23:25
     this.isCreatingProjectSignal.set(true);
   }
 
-  cancelCreateProject() {
-    this.isCreatingProjectSignal.set(false);
-  }
+  cancelCreateProject() {}
 
 

[NoCoverage] BooleanLiteral
src/app/projects/projects-signals.service.ts:24:38
   }
 
   cancelCreateProject() {
-    this.isCreatingProjectSignal.set(false);
+    this.isCreatingProjectSignal.set(true);
   }
 

[Killed] BlockStatement
src/app/projects/projects-signals.service.ts:28:47
   }
 
 
-  selectProject(selected: Project | undefined){
-    this.projectCollaboratorsSelectedSignal.set(undefined);
-    this.projectSelectedSignal.set(selected);
-  }
+  selectProject(selected: Project | undefined){}
 
   selectProjectCollaborators(selected: Project | undefined){
killedBy: ProjectsSignalsService should set projectCollaboratorSelected and projectSelected when calling selectProject
statusReason: Expected undefined to equal Object({ id: 'p1', title: 'ProjOne', acronym: 'PONE', periodDate: Object({ initDate: Date(Mon Jun 10 2019 01:00:00 GMT+0100 (Hora de verão da Europa Ocidental)), finalDate: Date(Mon Dec 01 2025 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)) }) }).

[Killed] BlockStatement
src/app/projects/projects-signals.service.ts:33:60
     this.projectSelectedSignal.set(selected);
   }
 
-  selectProjectCollaborators(selected: Project | undefined){
-    this.projectSelectedSignal.set(undefined);
-    this.projectCollaboratorsSelectedSignal.set(selected);
-  }
+  selectProjectCollaborators(selected: Project | undefined){}
 
   createProject(projectCreated : Project){
killedBy: ProjectsSignalsService should set projectSelected and projectCollaboratorSelected when calling selectProjectCollaborators
statusReason: Expected undefined to equal Object({ id: 'p1', title: 'ProjOne', acronym: 'PONE', periodDate: Object({ initDate: Date(Mon Jun 10 2019 01:00:00 GMT+0100 (Hora de verão da Europa Ocidental)), finalDate: Date(Mon Dec 01 2025 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)) }) }).

[NoCoverage] BlockStatement
src/app/projects/projects-signals.service.ts:38:42
     this.projectCollaboratorsSelectedSignal.set(selected);
   }
 
-  createProject(projectCreated : Project){
-    this.projectCreatedSignal.set(projectCreated);
-  }
+  createProject(projectCreated : Project){}
 }
 
