[Killed] BlockStatement
src/app/projects/projects.component.ts:26:17
   projectDataService = inject(ProjectsDataService);
   projects = signal<Project[]>([]);
 
-  constructor() {
-    this.projectDataService.getProjects().subscribe({
-    next: (projects) => {
-      this.projects.set(projects);
-    },
-    error:(error) => {
-      alert('Error loading projects');
-      console.error('Error loading projects', error);
-    }
-   })
-
-    this.projectSignalService.selectProject(undefined);
-    this.projectSignalService.selectProjectCollaborators(undefined);
-
-    effect(() => {
-      const projectCreated = this.projectCreatedSignal();
-
-      if(projectCreated){
-        this.projects.update(projects => [...projects, projectCreated]); 
-      }
-    })
-  }
+  constructor() {}
 
 
killedBy: AppComponent should request projects after 'Projects' button in the header is clicked; ProjectsComponent should update projects list when projectCreatedSignal changes
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:5073/api/Project", found none.

[Killed] BlockStatement
src/app/projects/projects.component.ts:28:25
 
   constructor() {
     this.projectDataService.getProjects().subscribe({
-    next: (projects) => {
-      this.projects.set(projects);
-    },
+    next: (projects) => {},
     error:(error) => {
       alert('Error loading projects');
killedBy: ProjectsComponent should update projects list when projectCreatedSignal changes
statusReason: Expected $.length = 1 to equal 3.
Expected $[0].id = '3' to equal '1'.
Expected $[0].title = 'Test 3' to equal 'Test 1'.
Expected $[0].acronym = 'T3' to equal 'T1'.
Expected $[1] = undefined to equal Object({ id: '2', title: 'Test 2', acronym: 'T2', periodDate: Object({ initDate: Date(Sat Feb 01 2020 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)), finalDate: Date(Mon Feb 01 2021 00:00:00 GMT

[NoCoverage] BlockStatement
src/app/projects/projects.component.ts:31:22
     next: (projects) => {
       this.projects.set(projects);
     },
-    error:(error) => {
-      alert('Error loading projects');
-      console.error('Error loading projects', error);
-    }
+    error:(error) => {}
    })
 

[NoCoverage] StringLiteral
src/app/projects/projects.component.ts:33:21
     },
     error:(error) => {
       alert('Error loading projects');
-      console.error('Error loading projects', error);
+      console.error("", error);
     }
    })

[Killed] BlockStatement
src/app/projects/projects.component.ts:40:18
     this.projectSignalService.selectProject(undefined);
     this.projectSignalService.selectProjectCollaborators(undefined);
 
-    effect(() => {
-      const projectCreated = this.projectCreatedSignal();
-
-      if(projectCreated){
-        this.projects.update(projects => [...projects, projectCreated]); 
-      }
-    })
+    effect(() => {})
   }
 
killedBy: ProjectsComponent should update projects list when projectCreatedSignal changes
statusReason: Expected $.length = 2 to equal 3.
Expected $[2] = undefined to equal Object({ id: '3', title: 'Test 3', acronym: 'T3', periodDate: Object({ initDate: Date(Sat Feb 01 2020 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)), finalDate: Date(Mon Feb 01 2021 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)) }) }).

[Killed] ConditionalExpression
src/app/projects/projects.component.ts:43:10
     effect(() => {
       const projectCreated = this.projectCreatedSignal();
 
-      if(projectCreated){
+      if(true){
         this.projects.update(projects => [...projects, projectCreated]); 
       }
killedBy: AppComponent should request projects after 'Projects' button in the header is clicked; ProjectsComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'acronym')

[Killed] BlockStatement
src/app/projects/projects.component.ts:43:25
     effect(() => {
       const projectCreated = this.projectCreatedSignal();
 
-      if(projectCreated){
-        this.projects.update(projects => [...projects, projectCreated]); 
-      }
+      if(projectCreated){}
     })
   }
killedBy: ProjectsComponent should update projects list when projectCreatedSignal changes
statusReason: Expected $.length = 2 to equal 3.
Expected $[2] = undefined to equal Object({ id: '3', title: 'Test 3', acronym: 'T3', periodDate: Object({ initDate: Date(Sat Feb 01 2020 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)), finalDate: Date(Mon Feb 01 2021 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)) }) }).

[Timeout] ArrowFunction
src/app/projects/projects.component.ts:44:30
       const projectCreated = this.projectCreatedSignal();
 
       if(projectCreated){
-        this.projects.update(projects => [...projects, projectCreated]); 
+        this.projects.update(() => undefined); 
       }
     })

[NoCoverage] BlockStatement
src/app/projects/projects.component.ts:50:17
   }
 
 
-  startCreate() {
-    this.projectSignalService.startCreateProject();
-  }
+  startCreate() {}
 }
 
