[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:34:17
   collaboratorSelected = this.collaboratorSignalService.selectedCollaborator;
   collaboratorProjectsSelected = this.collaboratorSignalService.selectedCollaboratorProjects;
 
-  constructor() {
-    effect(() => {
-      if (this.projectId()) {
-        //reset the selected collaborator
-        this.collaboratorSignalService.selectCollaborator(undefined);
-        this.projectsDataService.getAssociations(this.projectId()!).subscribe((associations => {
-          this.associations = associations
-        }))
-      }
-      if (this.collaboratorId()) {
-        //reset the selected project
-        this.projectSignalService.selectProject(undefined);
-        this.collaboratorDataService.getAssociations(this.collaboratorId()!).subscribe((associations) => {
-          this.associations = associations;
-        });
-      }
-    });
-  }
+  constructor() {}
 
   onSelectCollaboratorDetails(assoc: AssociationProjectCollaborators) {
killedBy: AssociationsProjectCollaboratorComponent should reset selected project and fetch collaborator projects when passing a collaboratorId
statusReason: Expected spy ProjectsSignalService.selectProject to have been called only once, and with given args:
  [ undefined ]
But it was never called.


Error: Expected spy ProjectsSignalService.selectProject to have been called only once, and with given args:
  [ undefined ]
But it was never called.

[Timeout] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:35:18
   collaboratorProjectsSelected = this.collaboratorSignalService.selectedCollaboratorProjects;
 
   constructor() {
-    effect(() => {
-      if (this.projectId()) {
-        //reset the selected collaborator
-        this.collaboratorSignalService.selectCollaborator(undefined);
-        this.projectsDataService.getAssociations(this.projectId()!).subscribe((associations => {
-          this.associations = associations
-        }))
-      }
-      if (this.collaboratorId()) {
-        //reset the selected project
-        this.projectSignalService.selectProject(undefined);
-        this.collaboratorDataService.getAssociations(this.collaboratorId()!).subscribe((associations) => {
-          this.associations = associations;
-        });
-      }
-    });
+    effect(() => {});
   }
 

[Timeout] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:36:29
 
   constructor() {
     effect(() => {
-      if (this.projectId()) {
-        //reset the selected collaborator
-        this.collaboratorSignalService.selectCollaborator(undefined);
-        this.projectsDataService.getAssociations(this.projectId()!).subscribe((associations => {
-          this.associations = associations
-        }))
-      }
+      if (this.projectId()) {}
       if (this.collaboratorId()) {
         //reset the selected project

[Timeout] ConditionalExpression
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:36:11
 
   constructor() {
     effect(() => {
-      if (this.projectId()) {
+      if (false) {
         //reset the selected collaborator
         this.collaboratorSignalService.selectCollaborator(undefined);

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:39:96
       if (this.projectId()) {
         //reset the selected collaborator
         this.collaboratorSignalService.selectCollaborator(undefined);
-        this.projectsDataService.getAssociations(this.projectId()!).subscribe((associations => {
-          this.associations = associations
-        }))
+        this.projectsDataService.getAssociations(this.projectId()!).subscribe((associations => {}))
       }
       if (this.collaboratorId()) {
killedBy: AssociationsProjectCollaboratorComponent should render email column and collaborator details button when projectId is set
statusReason: TypeError: Cannot read properties of null (reading 'textContent')

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:43:34
           this.associations = associations
         }))
       }
-      if (this.collaboratorId()) {
-        //reset the selected project
-        this.projectSignalService.selectProject(undefined);
-        this.collaboratorDataService.getAssociations(this.collaboratorId()!).subscribe((associations) => {
-          this.associations = associations;
-        });
-      }
+      if (this.collaboratorId()) {}
     });
   }
killedBy: AssociationsProjectCollaboratorComponent should reset selected project and fetch collaborator projects when passing a collaboratorId
statusReason: Expected spy ProjectsSignalService.selectProject to have been called only once, and with given args:
  [ undefined ]
But it was never called.


Error: Expected spy ProjectsSignalService.selectProject to have been called only once, and with given args:
  [ undefined ]
But it was never called.

[Killed] ConditionalExpression
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:43:11
           this.associations = associations
         }))
       }
-      if (this.collaboratorId()) {
+      if (false) {
         //reset the selected project
         this.projectSignalService.selectProject(undefined);
killedBy: AssociationsProjectCollaboratorComponent should reset selected project and fetch collaborator projects when passing a collaboratorId
statusReason: Expected spy ProjectsSignalService.selectProject to have been called only once, and with given args:
  [ undefined ]
But it was never called.


Error: Expected spy ProjectsSignalService.selectProject to have been called only once, and with given args:
  [ undefined ]
But it was never called.

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:46:106
       if (this.collaboratorId()) {
         //reset the selected project
         this.projectSignalService.selectProject(undefined);
-        this.collaboratorDataService.getAssociations(this.collaboratorId()!).subscribe((associations) => {
-          this.associations = associations;
-        });
+        this.collaboratorDataService.getAssociations(this.collaboratorId()!).subscribe((associations) => {});
       }
     });
killedBy: AssociationsProjectCollaboratorComponent should render acronym column and project details button when collaboratorId is set
statusReason: TypeError: Cannot read properties of null (reading 'textContent')

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:53:71
     });
   }
 
-  onSelectCollaboratorDetails(assoc: AssociationProjectCollaborators) {
-    this.collaboratorDataService.getCollabById(assoc.collaboratorId).subscribe({
-      next: (collab) => {
-        this.collaboratorSignalService.selectCollaborator(collab);
-      },
-      error: (error) => {
-        console.log(error);
-      }
-    })
-  }
+  onSelectCollaboratorDetails(assoc: AssociationProjectCollaborators) {}
 
   onSelectProjectDetails(assoc: AssociationProjectCollaborators) {
killedBy: AssociationsProjectCollaboratorComponent should get collaborator by Id and select it successfully when passing existing Id
statusReason: Expected spy CollaboratorSignalService.getCollabById to have been called only once, and with given args:
  [ 'c1' ]
But it was never called.


Error: Expected spy CollaboratorSignalService.getCollabById to have been called only once, and with given args:
  [ 'c1' ]
But it was never called.

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:55:25
 
   onSelectCollaboratorDetails(assoc: AssociationProjectCollaborators) {
     this.collaboratorDataService.getCollabById(assoc.collaboratorId).subscribe({
-      next: (collab) => {
-        this.collaboratorSignalService.selectCollaborator(collab);
-      },
+      next: (collab) => {},
       error: (error) => {
         console.log(error);
killedBy: AssociationsProjectCollaboratorComponent should get collaborator by Id and select it successfully when passing existing Id
statusReason: Expected spy CollaboratorSignalService.selectCollaborator to have been called only once, and with given args:
But it was never called.


Error: Expected spy CollaboratorSignalService.selectCollaborator to have been called only once, and with given args:
But it was never called.

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:58:25
       next: (collab) => {
         this.collaboratorSignalService.selectCollaborator(collab);
       },
-      error: (error) => {
-        console.log(error);
-      }
+      error: (error) => {}
     })
   }
killedBy: AssociationsProjectCollaboratorComponent should console log the error when getCollabId can't return a collaborator
statusReason: Expected spy log to have been called only once, and with given args:
  [ Error: Random error message! ]
But it was never called.


Error: Expected spy log to have been called only once, and with given args:
  [ Error: Random error message! ]
But it was never called.

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:64:66
     })
   }
 
-  onSelectProjectDetails(assoc: AssociationProjectCollaborators) {
-    this.projectsDataService.getProjectById(assoc.projectId).subscribe((project) => {
-      this.projectSignalService.selectProject(project);
-    });
-  }
+  onSelectProjectDetails(assoc: AssociationProjectCollaborators) {}
 }
 
killedBy: AssociationsProjectCollaboratorComponent should get collaborator by Id and select it successfully when passing existing Id
statusReason: Expected spy ProjectsDataService.getProjectById to have been called only once, and with given args:
  [ 'p1' ]
But it was never called.


Error: Expected spy ProjectsDataService.getProjectById to have been called only once, and with given args:
  [ 'p1' ]
But it was never called.

[Killed] BlockStatement
src/app/associations-project-collaborator/associations-project-collaborator.component.ts:65:85
   }
 
   onSelectProjectDetails(assoc: AssociationProjectCollaborators) {
-    this.projectsDataService.getProjectById(assoc.projectId).subscribe((project) => {
-      this.projectSignalService.selectProject(project);
-    });
+    this.projectsDataService.getProjectById(assoc.projectId).subscribe((project) => {});
   }
 }
killedBy: AssociationsProjectCollaboratorComponent should get collaborator by Id and select it successfully when passing existing Id
statusReason: Expected spy ProjectsSignalService.selectProject to have been called only once, and with given args:
  [ Object({ id: 'p1', title: 'title', acronym: 'TITLE', periodDate: Object({ initDate: Date(Tue Jun 03 2025 17:52:24 GMT+0100 (Hora de verão da Europa Ocidental)), finalDate: Date(Tue Jun 03 2025 17:52:24 GMT+0100 (Hora de verão da Europa Ocidental)) }) }) ]
But it was never called.


Error: Expec
