[Killed] BlockStatement
src/app/collaborators/collaborator-data.service.ts:21:44
   constructor(){
   }
 
-  getCollabs(): Observable<Collaborator[]> {
-    return this.httpClient.get<Collaborator[]>(`${this.baseUrl}/collaborators/details`);
-  }
+  getCollabs(): Observable<Collaborator[]> {}
 
   getCollabById(id: string): Observable<Collaborator> {
killedBy: AppComponent should request collaborators after 'Collaborators' button in the header is clicked; CollaboratorDataService should fetch all collaborators
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/collaborators/collaborator-data.service.ts:25:55
     return this.httpClient.get<Collaborator[]>(`${this.baseUrl}/collaborators/details`);
   }
 
-  getCollabById(id: string): Observable<Collaborator> {
-    return this.httpClient.get<Collaborator>(`${this.baseUrl}/collaborators/${id}/details`);
-  }
+  getCollabById(id: string): Observable<Collaborator> {}
 
   createCollaborator(newCollaborator: CollaboratorCreateRequest ): Observable<Collaborator> {
killedBy: CollaboratorDataService should fetch collaborator by the id
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Timeout] BlockStatement
src/app/collaborators/collaborator-data.service.ts:29:93
     return this.httpClient.get<Collaborator>(`${this.baseUrl}/collaborators/${id}/details`);
   }
 
-  createCollaborator(newCollaborator: CollaboratorCreateRequest ): Observable<Collaborator> {
-    return this.httpClient.post<Collaborator>(`${this.baseUrl}/collaborators`, newCollaborator)
-  }
+  createCollaborator(newCollaborator: CollaboratorCreateRequest ): Observable<Collaborator> {}
 
   updateCollaborator(updatedCollaborator: Collaborator) {

[Killed] StringLiteral
src/app/collaborators/collaborator-data.service.ts:30:47
   }
 
   createCollaborator(newCollaborator: CollaboratorCreateRequest ): Observable<Collaborator> {
-    return this.httpClient.post<Collaborator>(`${this.baseUrl}/collaborators`, newCollaborator)
+    return this.httpClient.post<Collaborator>(``, newCollaborator)
   }
 
killedBy: CollaboratorDataService should create collaborator given a request object
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:5073/api/collaborators", found none. Requests received are: POST .

[Timeout] BlockStatement
src/app/collaborators/collaborator-data.service.ts:33:57
     return this.httpClient.post<Collaborator>(`${this.baseUrl}/collaborators`, newCollaborator)
   }
 
-  updateCollaborator(updatedCollaborator: Collaborator) {
-    return this.httpClient.put<Collaborator>(`${this.baseUrl}/collaborators`, updatedCollaborator);
-  }
+  updateCollaborator(updatedCollaborator: Collaborator) {}
 
   getCollaboratorHolidays(collaboratorId: string): Observable<HolidayPeriod[]> {

[Killed] BlockStatement
src/app/collaborators/collaborator-data.service.ts:37:80
     return this.httpClient.put<Collaborator>(`${this.baseUrl}/collaborators`, updatedCollaborator);
   }
 
-  getCollaboratorHolidays(collaboratorId: string): Observable<HolidayPeriod[]> {
-    return this.httpClient.get<HolidayPeriod[]>(`${this.baseUrl}/collaborators/${collaboratorId}/holidayplan/holidayperiod`);
-  }
+  getCollaboratorHolidays(collaboratorId: string): Observable<HolidayPeriod[]> {}
 
   addHoliday(collabId: string, initDate: string, finalDate: string) {
killedBy: CollaboratorDataService should fetch collaborator's holiday periods
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
src/app/collaborators/collaborator-data.service.ts:38:49
   }
 
   getCollaboratorHolidays(collaboratorId: string): Observable<HolidayPeriod[]> {
-    return this.httpClient.get<HolidayPeriod[]>(`${this.baseUrl}/collaborators/${collaboratorId}/holidayplan/holidayperiod`);
+    return this.httpClient.get<HolidayPeriod[]>(``);
   }
 
killedBy: CollaboratorDataService should fetch collaborator's holiday periods
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:5073/api/collaborators/1/holidayplan/holidayperiod", found none. Requests received are: GET .

[Killed] BlockStatement
src/app/collaborators/collaborator-data.service.ts:41:69
     return this.httpClient.get<HolidayPeriod[]>(`${this.baseUrl}/collaborators/${collaboratorId}/holidayplan/holidayperiod`);
   }
 
-  addHoliday(collabId: string, initDate: string, finalDate: string) {
-    return this.httpClient.post<HolidayPeriod>(`${this.baseUrl}/collaborators/${collabId}/holidayplan/holidayperiod`, {initDate: initDate, finalDate: finalDate});
-  }
+  addHoliday(collabId: string, initDate: string, finalDate: string) {}
 
   editHoliday(collaboratorId: string, updatedPeriod: HolidayPeriod){
killedBy: CollaboratorDataService should add a new holiday period to a user's holiday plan
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/collaborators/collaborator-data.service.ts:45:68
     return this.httpClient.post<HolidayPeriod>(`${this.baseUrl}/collaborators/${collabId}/holidayplan/holidayperiod`, {initDate: initDate, finalDate: finalDate});
   }
 
-  editHoliday(collaboratorId: string, updatedPeriod: HolidayPeriod){
-    return this.httpClient.put<HolidayPeriod>(`${this.baseUrl}/collaborators/${collaboratorId}/holidayplan/holidayperiod`, updatedPeriod);
-  }
+  editHoliday(collaboratorId: string, updatedPeriod: HolidayPeriod){}
 
   getAssociations(id: string): Observable<AssociationProjectCollaborators[]> {
killedBy: CollaboratorDataService should update the edited holiday period
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/collaborators/collaborator-data.service.ts:49:78
     return this.httpClient.put<HolidayPeriod>(`${this.baseUrl}/collaborators/${collaboratorId}/holidayplan/holidayperiod`, updatedPeriod);
   }
 
-  getAssociations(id: string): Observable<AssociationProjectCollaborators[]> {
-    return this.httpClient.get<AssociationProjectCollaborators[]>(`${this.baseUrl}/collaborators/${id}/associations`);
-  }
+  getAssociations(id: string): Observable<AssociationProjectCollaborators[]> {}
 }
 
killedBy: CollaboratorDataService should fetch associations by id
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
