[Killed] BlockStatement
app/collaborators/collaborator-list/collaborator-list.component.ts:20:59
     this.collaboratorSignalService.selectCollaborator(collaborator);
   }
 
-  onSelectCollaboratorHolidays(collaborator: Collaborator){
-    this.collaboratorSignalService.selectCollaboratorHolidays(collaborator);
-  }
+  onSelectCollaboratorHolidays(collaborator: Collaborator){}
 
   onSelectCollaboratorProjects(collaborator: Collaborator){
killedBy: CollaboratorListComponent should call selectCollaboratorHolidays with the selected collaborator when holidays button is clicked
statusReason: Expected spy CollaboratorSignalService.selectCollaboratorHolidays to have been called only once, and with given args:
But it was never called.


Error: Expected spy CollaboratorSignalService.selectCollaboratorHolidays to have been called only once, and with given args:
But it was never called.

[Killed] BlockStatement
app/collaborators/collaborator-list/collaborator-list.component.ts:24:59
     this.collaboratorSignalService.selectCollaboratorHolidays(collaborator);
   }
 
-  onSelectCollaboratorProjects(collaborator: Collaborator){
-    this.collaboratorSignalService.selectCollaboratorProjects(collaborator);
-  }
+  onSelectCollaboratorProjects(collaborator: Collaborator){}
 }
 
killedBy: CollaboratorListComponent should call selectCollaboratorProjects with the selected collaborator when projects button is clicked
statusReason: Expected spy CollaboratorSignalService.selectCollaboratorProjects to have been called only once, and with given args:
But it was never called.


Error: Expected spy CollaboratorSignalService.selectCollaboratorProjects to have been called only once, and with given args:
But it was never called.
