[Killed] ConditionalExpression
app/collaborators/collaborators-create/collaborator-create.component.ts:34:9
   }
 
   onSubmit() {
-    if (this.form.invalid) {
+    if (true) {
       alert("Please fill all required fields.")
       return;
killedBy: CollaboratorCreateComponent should call createCollaborator with correct data on submit
statusReason: Expected spy CollaboratorDataService.createCollaborator to have been called with:
  [ <jasmine.objectContaining(Object({ names: 'John', surnames: 'Doe', email: 'john.doe@example.com' }))> ]
but it was never called.

[Killed] BlockStatement
app/collaborators/collaborators-create/collaborator-create.component.ts:34:28
   }
 
   onSubmit() {
-    if (this.form.invalid) {
-      alert("Please fill all required fields.")
-      return;
-    }
+    if (this.form.invalid) {}
 
     const formValue = this.form.getRawValue();
killedBy: CollaboratorCreateComponent should emit alert if required fields of collaborator are not filled in and dont request
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
app/collaborators/collaborators-create/collaborator-create.component.ts:35:13
 
   onSubmit() {
     if (this.form.invalid) {
-      alert("Please fill all required fields.")
+      alert("")
       return;
     }
killedBy: CollaboratorCreateComponent should emit alert if required fields of collaborator are not filled in and dont request
statusReason: Expected spy alert to have been called with:
  [ 'Please fill all required fields.' ]
but actual calls were:
  [ '' ].

Call 0:
  Expected $[0] = '' to equal 'Please fill all required fields.'.
Error: Expected spy alert to have been called with:

[Killed] BooleanLiteral
app/collaborators/collaborators-create/collaborator-create.component.ts:41:9
 
     const formValue = this.form.getRawValue();
 
-    if (!formValue.collaboratorPeriod) return;
+    if (formValue.collaboratorPeriod) return;
 
     const newCollaborator: CollaboratorCreateRequest = {
killedBy: CollaboratorCreateComponent should call createCollaborator with correct data on submit
statusReason: Expected spy CollaboratorDataService.createCollaborator to have been called with:
  [ <jasmine.objectContaining(Object({ names: 'John', surnames: 'Doe', email: 'john.doe@example.com' }))> ]
but it was never called.

[Killed] ConditionalExpression
app/collaborators/collaborators-create/collaborator-create.component.ts:41:9
 
     const formValue = this.form.getRawValue();
 
-    if (!formValue.collaboratorPeriod) return;
+    if (true) return;
 
     const newCollaborator: CollaboratorCreateRequest = {
killedBy: CollaboratorCreateComponent should call createCollaborator with correct data on submit
statusReason: Expected spy CollaboratorDataService.createCollaborator to have been called with:
  [ <jasmine.objectContaining(Object({ names: 'John', surnames: 'Doe', email: 'john.doe@example.com' }))> ]
but it was never called.

[Killed] ObjectLiteral
app/collaborators/collaborators-create/collaborator-create.component.ts:56:80
 
 
     // O subscribe é necessario porque ao fazeres um pedido http ele retorna um Observable que tem de ser subscrito
-    this.collaboratorDataService.createCollaborator(newCollaborator).subscribe({
-      next: (createdCollaborator) => {
-        console.log('Created collaborator:', createdCollaborator);
-        this.collaboratorSignalService.createCollaborator(createdCollaborator);
-        this.collaboratorSignalService.cancelCreateCollaborator?.();
-        this.form.reset();
-
-      },
-      error: (error) => {
-        console.error('Error creating collaborator:', error);
-      }
-    });
+    this.collaboratorDataService.createCollaborator(newCollaborator).subscribe({});
   }
 
killedBy: CollaboratorCreateComponent should call createCollaborator with correct data on submit
statusReason: Expected spy CollaboratorSignalService.cancelCreateCollaborator to have been called.

[Killed] BlockStatement
app/collaborators/collaborators-create/collaborator-create.component.ts:57:38
 
     // O subscribe é necessario porque ao fazeres um pedido http ele retorna um Observable que tem de ser subscrito
     this.collaboratorDataService.createCollaborator(newCollaborator).subscribe({
-      next: (createdCollaborator) => {
-        console.log('Created collaborator:', createdCollaborator);
-        this.collaboratorSignalService.createCollaborator(createdCollaborator);
-        this.collaboratorSignalService.cancelCreateCollaborator?.();
-        this.form.reset();
-
-      },
+      next: (createdCollaborator) => {},
       error: (error) => {
         console.error('Error creating collaborator:', error);
killedBy: CollaboratorCreateComponent should call createCollaborator with correct data on submit
statusReason: Expected spy CollaboratorSignalService.cancelCreateCollaborator to have been called.

[Survived] OptionalChaining
app/collaborators/collaborators-create/collaborator-create.component.ts:60:9
       next: (createdCollaborator) => {
         console.log('Created collaborator:', createdCollaborator);
         this.collaboratorSignalService.createCollaborator(createdCollaborator);
-        this.collaboratorSignalService.cancelCreateCollaborator?.();
+        this.collaboratorSignalService.cancelCreateCollaborator();
         this.form.reset();
 

[Killed] BlockStatement
app/collaborators/collaborators-create/collaborator-create.component.ts:64:25
         this.form.reset();
 
       },
-      error: (error) => {
-        console.error('Error creating collaborator:', error);
-      }
+      error: (error) => {}
     });
   }
killedBy: CollaboratorCreateComponent should handle error from createCollaborator
statusReason: Expected spy error to have been called with:
  [ 'Error creating collaborator:', <jasmine.any(Error)> ]
but it was never called.

[Killed] StringLiteral
app/collaborators/collaborators-create/collaborator-create.component.ts:65:23
 
       },
       error: (error) => {
-        console.error('Error creating collaborator:', error);
+        console.error("", error);
       }
     });
killedBy: CollaboratorCreateComponent should handle error from createCollaborator
statusReason: Expected spy error to have been called with:
  [ 'Error creating collaborator:', <jasmine.any(Error)> ]
but actual calls were:
  [ '', Error: API error ].

Call 0:
  Expected $[0] = '' to equal 'Error creating collaborator:'.
Error: Expected spy error to have been called with:

[Killed] BlockStatement
app/collaborators/collaborators-create/collaborator-create.component.ts:71:14
   }
 
 
-  onCancel() {
-    this.collaboratorSignalService.cancelCreateCollaborator?.();
-    this.form.reset();
-  }
+  onCancel() {}
 }
 
killedBy: CollaboratorCreateComponent should reset form and call cancel on cancel
statusReason: Expected spy reset to have been called.

[Survived] OptionalChaining
app/collaborators/collaborators-create/collaborator-create.component.ts:72:5
 
 
   onCancel() {
-    this.collaboratorSignalService.cancelCreateCollaborator?.();
+    this.collaboratorSignalService.cancelCreateCollaborator();
     this.form.reset();
   }
