[Killed] BlockStatement
app/projects/projects-table/projects-table.component.ts:17:37
 
   projectSignalService = inject(ProjectsSignalsService);
 
-  onSelectProject(selected: Project){
-    this.projectSignalService.selectProject(selected);
-  }
+  onSelectProject(selected: Project){}
 
   onSelectProjectCollaborators(selected: Project){
killedBy: ProjectsTableComponent should call onSelectProject with the selected project when a button Project Details is clicked
statusReason: Expected spy CollaboratorSignalService.selectProject to have been called only once, and with given args:
  [ Object({ id: '2', title: 'Project2', acronym: 'P2', periodDate: Object({ initDate: Date(Tue Mar 01 2022 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)), finalDate: Date(Thu Sep 30 2027 01:00:00 GMT+0100 (Hora de verão da Europa Ocidental)) }) }) ]
But it was never called.


Error: Expe

[Killed] BlockStatement
app/projects/projects-table/projects-table.component.ts:21:50
     this.projectSignalService.selectProject(selected);
   }
 
-  onSelectProjectCollaborators(selected: Project){
-    this.projectSignalService.selectProjectCollaborators(selected);
-  }
+  onSelectProjectCollaborators(selected: Project){}
 }
 
killedBy: ProjectsTableComponent should call onSelectProjectCollaborators with the selected project when a button Project Collaborators is clicked
statusReason: Expected spy CollaboratorSignalService.selectProjectCollaborators to have been called only once, and with given args:
  [ Object({ id: '2', title: 'Project2', acronym: 'P2', periodDate: Object({ initDate: Date(Tue Mar 01 2022 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)), finalDate: Date(Thu Sep 30 2027 01:00:00 GMT+0100 (Hora de verão da Europa Ocidental)) }) }) ]
But it was never called.
