[Killed] ObjectLiteral
src/app/app.routes.ts:8:5
 import { CollaboratorsComponent } from './collaborators/collaborators.component';
 
 export const routes: Routes = [
-    {
-        path: '',
-        component: HomeComponent
-    },
+    {},
     {
         path: 'projects',
killedBy: AppComponent should create the app; HeaderComponent should create
statusReason: Error: NG04014: Invalid configuration of route ''. One of the following must be provided: component, loadComponent, redirectTo, children or loadChildren
error properties: Object({ code: 4014 })
