[NoCoverage] BooleanLiteral
src/app/app.config.ts:8:61
 import { provideHttpClient } from '@angular/common/http';
 
 export const appConfig: ApplicationConfig = {
-  providers: [provideZoneChangeDetection({ eventCoalescing: true }), provideRouter(routes, withComponentInputBinding()), 
+  providers: [provideZoneChangeDetection({ eventCoalescing: false }), provideRouter(routes, withComponentInputBinding()), 
               provideHttpClient()]
 };

[NoCoverage] ObjectLiteral
src/app/app.config.ts:8:42
 import { provideHttpClient } from '@angular/common/http';
 
 export const appConfig: ApplicationConfig = {
-  providers: [provideZoneChangeDetection({ eventCoalescing: true }), provideRouter(routes, withComponentInputBinding()), 
+  providers: [provideZoneChangeDetection({}), provideRouter(routes, withComponentInputBinding()), 
               provideHttpClient()]
 };
