[Survived] StringLiteral
src/app/collaborators/collaborator.service.ts:19:29
       surnames: "Johnson",
       email: "alice.johnson@example.com",
       periodDateTime: {
-        _initDate: new Date("2019-06-10"),
+        _initDate: new Date(""),
         _finalDate: new Date("2025-12-31")
       }

[Survived] StringLiteral
src/app/collaborators/collaborator.service.ts:30:30
       email: "bob.martinez@example.com",
       periodDateTime: {
         _initDate: new Date("2021-02-01"),
-        _finalDate: new Date("2024-07-30")
+        _finalDate: new Date("")
       }
     },

[Survived] StringLiteral
src/app/collaborators/collaborator.service.ts:34:11
       }
     },
     {
-      id: "3",
+      id: "",
       names: "Clara",
       surnames: "Nguyen",

[NoCoverage] BlockStatement
src/app/collaborators/collaborator.service.ts:49:47
 
   constructor() { }
 
-  getCollaboratorsIds(): Observable<string[]> {
-    return this.httpClient.get<string[]>('https://localhost:7271/api/collaborators/');
-  }
+  getCollaboratorsIds(): Observable<string[]> {}
 
   getCollaboratorById(id: string): Observable<Collaborator> {

[NoCoverage] StringLiteral
src/app/collaborators/collaborator.service.ts:50:42
   constructor() { }
 
   getCollaboratorsIds(): Observable<string[]> {
-    return this.httpClient.get<string[]>('https://localhost:7271/api/collaborators/');
+    return this.httpClient.get<string[]>("");
   }
 

[NoCoverage] BlockStatement
src/app/collaborators/collaborator.service.ts:53:61
     return this.httpClient.get<string[]>('https://localhost:7271/api/collaborators/');
   }
 
-  getCollaboratorById(id: string): Observable<Collaborator> {
-    return this.httpClient.get<Collaborator>('https://localhost:7271/api/collaborators/' + id);
-  }
+  getCollaboratorById(id: string): Observable<Collaborator> {}
 
   updateCollaborator(updated: CollaboratorDetails) {

[Survived] BlockStatement
src/app/collaborators/collaborator.service.ts:57:52
     return this.httpClient.get<Collaborator>('https://localhost:7271/api/collaborators/' + id);
   }
 
-  updateCollaborator(updated: CollaboratorDetails) {
-    this.collaborators.update(list => list.map(c => c.id === updated.id ? updated : c));
-  }
+  updateCollaborator(updated: CollaboratorDetails) {}
 }
 

[Killed] ArrowFunction
src/app/collaborators/collaborator.service.ts:58:48
   }
 
   updateCollaborator(updated: CollaboratorDetails) {
-    this.collaborators.update(list => list.map(c => c.id === updated.id ? updated : c));
+    this.collaborators.update(list => list.map(() => undefined));
   }
 }
killedBy: CollaboratorService updateCollaborator should update the collaborator with the same id
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/app/collaborators/collaborator.service.ts:58:53
   }
 
   updateCollaborator(updated: CollaboratorDetails) {
-    this.collaborators.update(list => list.map(c => c.id === updated.id ? updated : c));
+    this.collaborators.update(list => list.map(c => c.id !== updated.id ? updated : c));
   }
 }
killedBy: CollaboratorService updateCollaborator should update the collaborator with the same id
statusReason: Expected 'alice.johnson@example.com' to be 'alice.johnson@example.com.test'.
