[NoCoverage] BlockStatement
app/projects/add-collaborator-project/add-collaborator-project.component.ts:21:15
   startDate: string = '';
   endDate: string = '';
 
-  closeModal(){
-    this.closeForm.emit();
-  }
+  closeModal(){}
 
   onSubmit() {

[NoCoverage] BlockStatement
app/projects/add-collaborator-project/add-collaborator-project.component.ts:25:14
     this.closeForm.emit();
   }
 
-  onSubmit() {
-    const initDate = new Date(this.startDate).toISOString().split('T')[0];
-    const finalDate = new Date(this.endDate).toISOString().split('T')[0];
-
-    const periodDate: PeriodDateString = {
-      initDate: initDate,
-      finalDate: finalDate
-    }
-
-    const association: AddAssociationProjectCollaborator = {
-      collaboratorId: this.selectedCollaboratorId,
-      periodDate
-    };
-
-    this.submitForm.emit(association);
-  }
+  onSubmit() {}
 }
 

[NoCoverage] StringLiteral
app/projects/add-collaborator-project/add-collaborator-project.component.ts:27:66
 
   onSubmit() {
     const initDate = new Date(this.startDate).toISOString().split('T')[0];
-    const finalDate = new Date(this.endDate).toISOString().split('T')[0];
+    const finalDate = new Date(this.endDate).toISOString().split("")[0];
 
     const periodDate: PeriodDateString = {
