[Survived] BooleanLiteral
app/projects/project-details/project-details.component.ts:21:21
   projectCollaboratorsIds : string[] = [];
   private projectService = inject(ProjectService);
   private collaboratorService = inject(CollaboratorService);
-  addCollaborator = false;
+  addCollaborator = true;
   allCollaboratorsIds : string[] = [];
 

[Killed] BlockStatement
app/projects/project-details/project-details.component.ts:24:20
   addCollaborator = false;
   allCollaboratorsIds : string[] = [];
 
-  ngOnInit(): void {
-    this.projectService.getProject(this.projectId()).subscribe(data => {
-      this.project = data
-    })
-
-    this.projectService.getProjectCollaborators(this.projectId()).subscribe(data => {
-      this.projectCollaboratorsIds = data.map(p => p.id)
-    })
-  }
+  ngOnInit(): void {}
 
   onAddCollaborator(){
killedBy: ProjectDetailsComponent should display the project info
statusReason: Expected '' to be 'Test 1'.

[Timeout] BlockStatement
app/projects/project-details/project-details.component.ts:25:72
   allCollaboratorsIds : string[] = [];
 
   ngOnInit(): void {
-    this.projectService.getProject(this.projectId()).subscribe(data => {
-      this.project = data
-    })
+    this.projectService.getProject(this.projectId()).subscribe(data => {})
 
     this.projectService.getProjectCollaborators(this.projectId()).subscribe(data => {

[Killed] BlockStatement
app/projects/project-details/project-details.component.ts:29:85
       this.project = data
     })
 
-    this.projectService.getProjectCollaborators(this.projectId()).subscribe(data => {
-      this.projectCollaboratorsIds = data.map(p => p.id)
-    })
+    this.projectService.getProjectCollaborators(this.projectId()).subscribe(data => {})
   }
 
killedBy: ProjectDetailsComponent should display the project info
statusReason: Expected $.length = 0 to equal 2.
Expected $[0] = undefined to equal '1'.
Expected $[1] = undefined to equal '2'.

[Killed] ArrowFunction
app/projects/project-details/project-details.component.ts:30:47
     })
 
     this.projectService.getProjectCollaborators(this.projectId()).subscribe(data => {
-      this.projectCollaboratorsIds = data.map(p => p.id)
+      this.projectCollaboratorsIds = data.map(() => undefined)
     })
   }
killedBy: ProjectDetailsComponent should display the project info
statusReason: Expected $[0] = '' to equal '1'.
Expected $[1] = '' to equal '2'.

[Killed] BlockStatement
app/projects/project-details/project-details.component.ts:34:22
     })
   }
 
-  onAddCollaborator(){
-    this.addCollaborator = true;
-
-    const projectCollaboratorsIdsSet = new Set(this.projectCollaboratorsIds);
-    this.collaboratorService.getCollaboratorsIds().subscribe(data => {
-      this.allCollaboratorsIds = data.filter(c => !projectCollaboratorsIdsSet.has(c));
-    })
-  }
+  onAddCollaborator(){}
 
   addCollaboratorToProject(association : AddAssociationProjectCollaborator){
killedBy: ProjectDetailsComponent should display AddCollaboratorProjectComponent when Add Collaborator button is clicked
statusReason: Expected false to be true.

[Killed] BooleanLiteral
app/projects/project-details/project-details.component.ts:35:28
   }
 
   onAddCollaborator(){
-    this.addCollaborator = true;
+    this.addCollaborator = false;
 
     const projectCollaboratorsIdsSet = new Set(this.projectCollaboratorsIds);
killedBy: ProjectDetailsComponent should display AddCollaboratorProjectComponent when Add Collaborator button is clicked
statusReason: Expected false to be true.

[Survived] BlockStatement
app/projects/project-details/project-details.component.ts:38:70
     this.addCollaborator = true;
 
     const projectCollaboratorsIdsSet = new Set(this.projectCollaboratorsIds);
-    this.collaboratorService.getCollaboratorsIds().subscribe(data => {
-      this.allCollaboratorsIds = data.filter(c => !projectCollaboratorsIdsSet.has(c));
-    })
+    this.collaboratorService.getCollaboratorsIds().subscribe(data => {})
   }
 

[Survived] MethodExpression
app/projects/project-details/project-details.component.ts:39:34
 
     const projectCollaboratorsIdsSet = new Set(this.projectCollaboratorsIds);
     this.collaboratorService.getCollaboratorsIds().subscribe(data => {
-      this.allCollaboratorsIds = data.filter(c => !projectCollaboratorsIdsSet.has(c));
+      this.allCollaboratorsIds = data;
     })
   }

[Survived] ArrowFunction
app/projects/project-details/project-details.component.ts:39:46
 
     const projectCollaboratorsIdsSet = new Set(this.projectCollaboratorsIds);
     this.collaboratorService.getCollaboratorsIds().subscribe(data => {
-      this.allCollaboratorsIds = data.filter(c => !projectCollaboratorsIdsSet.has(c));
+      this.allCollaboratorsIds = data.filter(() => undefined);
     })
   }

[Killed] BlockStatement
app/projects/project-details/project-details.component.ts:43:76
     })
   }
 
-  addCollaboratorToProject(association : AddAssociationProjectCollaborator){
-    this.projectService.addCollaboratorToProject(this.projectId(), association).subscribe({
-      next: () => {
-        this.projectCollaboratorsIds = [...this.projectCollaboratorsIds, association.collaboratorId];
-      },
-      error: (err) => {
-        console.error('Error adding collaborator:', err);
-      }
-    });
-
-    this.addCollaborator = false;
-  }
+  addCollaboratorToProject(association : AddAssociationProjectCollaborator){}
 
   closeForm(){
killedBy: ProjectDetailsComponent should add collaborator and close form when addCollaboratorToProject is called
statusReason: Expected [ '1', '2' ] to contain '3'.

[Killed] ObjectLiteral
app/projects/project-details/project-details.component.ts:44:91
   }
 
   addCollaboratorToProject(association : AddAssociationProjectCollaborator){
-    this.projectService.addCollaboratorToProject(this.projectId(), association).subscribe({
-      next: () => {
-        this.projectCollaboratorsIds = [...this.projectCollaboratorsIds, association.collaboratorId];
-      },
-      error: (err) => {
-        console.error('Error adding collaborator:', err);
-      }
-    });
+    this.projectService.addCollaboratorToProject(this.projectId(), association).subscribe({});
 
     this.addCollaborator = false;
killedBy: ProjectDetailsComponent should add collaborator and close form when addCollaboratorToProject is called
statusReason: Expected [ '1', '2' ] to contain '3'.

[Killed] BlockStatement
app/projects/project-details/project-details.component.ts:45:19
 
   addCollaboratorToProject(association : AddAssociationProjectCollaborator){
     this.projectService.addCollaboratorToProject(this.projectId(), association).subscribe({
-      next: () => {
-        this.projectCollaboratorsIds = [...this.projectCollaboratorsIds, association.collaboratorId];
-      },
+      next: () => {},
       error: (err) => {
         console.error('Error adding collaborator:', err);
killedBy: ProjectDetailsComponent should add collaborator and close form when addCollaboratorToProject is called
statusReason: Expected [ '1', '2' ] to contain '3'.

[NoCoverage] BlockStatement
app/projects/project-details/project-details.component.ts:48:23
       next: () => {
         this.projectCollaboratorsIds = [...this.projectCollaboratorsIds, association.collaboratorId];
       },
-      error: (err) => {
-        console.error('Error adding collaborator:', err);
-      }
+      error: (err) => {}
     });
 

[Killed] BooleanLiteral
app/projects/project-details/project-details.component.ts:53:28
       }
     });
 
-    this.addCollaborator = false;
+    this.addCollaborator = true;
   }
 
killedBy: ProjectDetailsComponent should add collaborator and close form when addCollaboratorToProject is called
statusReason: Expected true to be false.

[Killed] BlockStatement
app/projects/project-details/project-details.component.ts:56:14
     this.addCollaborator = false;
   }
 
-  closeForm(){
-    this.addCollaborator = false;
-  }
+  closeForm(){}
 }
 
killedBy: ProjectDetailsComponent should close form when closeForm is called
statusReason: Expected <app-add-collaborator-project _ngcontent-a-c1871885014 _nghost-a-c3400663680 ng-reflect-all-collaborators-ids>...</app-add-collaborator-project> to be null.

[Killed] BooleanLiteral
app/projects/project-details/project-details.component.ts:57:28
   }
 
   closeForm(){
-    this.addCollaborator = false;
+    this.addCollaborator = true;
   }
 }
killedBy: ProjectDetailsComponent should close form when closeForm is called
statusReason: Expected <app-add-collaborator-project _ngcontent-a-c1871885014 _nghost-a-c3400663680 ng-reflect-all-collaborators-ids>...</app-add-collaborator-project> to be null.
