[Killed] BlockStatement
src/app/projects/project.service.ts:14:41
   private httpClient = inject(HttpClient);
   constructor() { }
 
-  getProjects() : Observable<Project[]> {
-    return this.httpClient.get<Project[]>('https://localhost:7271/api/Project');
-  }
+  getProjects() : Observable<Project[]> {}
 
   getProject(id : string) : Observable<Project> {
killedBy: ProjectService should return expected projects (HttpClient called once)
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/projects/project.service.ts:18:49
     return this.httpClient.get<Project[]>('https://localhost:7271/api/Project');
   }
 
-  getProject(id : string) : Observable<Project> {
-    return this.httpClient.get<Project>('https://localhost:7271/api/Project/' + id);
-  }
+  getProject(id : string) : Observable<Project> {}
 
   getProjectCollaborators(id : string) : Observable<Collaborator[]> {
killedBy: ProjectService should return expected project with provided id (HttpClient called once)
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[NoCoverage] BlockStatement
src/app/projects/project.service.ts:22:69
     return this.httpClient.get<Project>('https://localhost:7271/api/Project/' + id);
   }
 
-  getProjectCollaborators(id : string) : Observable<Collaborator[]> {
-    return this.httpClient.get<Collaborator[]>('https://localhost:7271/api/Project/' + id + '/collaborators');
-  }
+  getProjectCollaborators(id : string) : Observable<Collaborator[]> {}
 
   addCollaboratorToProject(id: string, association : AddAssociationProjectCollaborator) {

[NoCoverage] BlockStatement
src/app/projects/project.service.ts:26:89
     return this.httpClient.get<Collaborator[]>('https://localhost:7271/api/Project/' + id + '/collaborators');
   }
 
-  addCollaboratorToProject(id: string, association : AddAssociationProjectCollaborator) {
-    return this.httpClient.post('https://localhost:7271/api/Project/' + id + '/collaborators', association);
-  }
+  addCollaboratorToProject(id: string, association : AddAssociationProjectCollaborator) {}
 }
 

[NoCoverage] StringLiteral
src/app/projects/project.service.ts:27:78
   }
 
   addCollaboratorToProject(id: string, association : AddAssociationProjectCollaborator) {
-    return this.httpClient.post('https://localhost:7271/api/Project/' + id + '/collaborators', association);
+    return this.httpClient.post('https://localhost:7271/api/Project/' + id + "", association);
   }
 }
