[Timeout] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:16:20
   changedCollaborator = output<CollaboratorDetails>();
   form!: FormGroup;
 
-  ngOnInit(): void {
-    this.form = new FormGroup({
-      names: new FormControl(this.collaborator().names),
-      surnames: new FormControl(this.collaborator().surnames),
-      email: new FormControl(this.collaborator().email),
-      periodDateTime: new FormGroup({
-        initDate: new FormControl(this.formatDate(this.collaborator().periodDateTime._initDate)),
-        endDate: new FormControl(this.formatDate(this.collaborator().periodDateTime._finalDate))
-      })
-    });
-  }
+  ngOnInit(): void {}
 
   ngOnChanges(changes: SimpleChanges): void {

[Killed] ObjectLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:21:37
       names: new FormControl(this.collaborator().names),
       surnames: new FormControl(this.collaborator().surnames),
       email: new FormControl(this.collaborator().email),
-      periodDateTime: new FormGroup({
-        initDate: new FormControl(this.formatDate(this.collaborator().periodDateTime._initDate)),
-        endDate: new FormControl(this.formatDate(this.collaborator().periodDateTime._finalDate))
-      })
+      periodDateTime: new FormGroup({})
     });
   }
killedBy: CollaboratorsComponent should show collaborator details when CollaboratorListComponent emit selectedCollaborator; CollaboratorDetailsComponent should create
statusReason: Error: Cannot find control with path: 'periodDateTime -> initDate'

[Killed] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:28:45
     });
   }
 
-  ngOnChanges(changes: SimpleChanges): void {
-    const collabChange = changes['collaborator'];
-    if (collabChange && collabChange.previousValue &&
-      collabChange.previousValue.id !== collabChange.currentValue?.id
-    ) {
-      const collaborator: CollaboratorDetails = collabChange.currentValue;
-      this.form.patchValue({
-        names: collaborator.names,
-        surnames: collaborator.surnames,
-        email: collaborator.email,
-        periodDateTime: {
-          initDate: this.formatDate(collaborator.periodDateTime._initDate),
-          endDate: this.formatDate(collaborator.periodDateTime._finalDate)
-        }
-      });
-    }
-  }
+  ngOnChanges(changes: SimpleChanges): void {}
 
   private formatDate(date: Date): string {
killedBy: CollaboratorDetailsComponent should update form inputs when collaborator input changes
statusReason: Expected 'Alice' to equal 'Bob'.

[Killed] StringLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:29:34
   }
 
   ngOnChanges(changes: SimpleChanges): void {
-    const collabChange = changes['collaborator'];
+    const collabChange = changes[""];
     if (collabChange && collabChange.previousValue &&
       collabChange.previousValue.id !== collabChange.currentValue?.id
killedBy: CollaboratorDetailsComponent should update form inputs when collaborator input changes
statusReason: Expected 'Alice' to equal 'Bob'.

[Killed] LogicalOperator
app/collaborators/collaborator-details/collaborator-details.component.ts:30:9
 
   ngOnChanges(changes: SimpleChanges): void {
     const collabChange = changes['collaborator'];
-    if (collabChange && collabChange.previousValue &&
+    if (collabChange || collabChange.previousValue &&
       collabChange.previousValue.id !== collabChange.currentValue?.id
     ) {
killedBy: CollaboratorsComponent should show collaborator details when CollaboratorListComponent emit selectedCollaborator; CollaboratorDetailsComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
app/collaborators/collaborator-details/collaborator-details.component.ts:30:9
 
   ngOnChanges(changes: SimpleChanges): void {
     const collabChange = changes['collaborator'];
-    if (collabChange && collabChange.previousValue &&
-      collabChange.previousValue.id !== collabChange.currentValue?.id
+    if (collabChange && collabChange.previousValue || collabChange.previousValue.id !== collabChange.currentValue?.id
     ) {
       const collaborator: CollaboratorDetails = collabChange.currentValue;
killedBy: CollaboratorsComponent should show collaborator details when CollaboratorListComponent emit selectedCollaborator; CollaboratorDetailsComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
app/collaborators/collaborator-details/collaborator-details.component.ts:31:7
   ngOnChanges(changes: SimpleChanges): void {
     const collabChange = changes['collaborator'];
     if (collabChange && collabChange.previousValue &&
-      collabChange.previousValue.id !== collabChange.currentValue?.id
+      collabChange.previousValue.id === collabChange.currentValue?.id
     ) {
       const collaborator: CollaboratorDetails = collabChange.currentValue;
killedBy: CollaboratorDetailsComponent should update form inputs when collaborator input changes
statusReason: Expected 'Alice' to equal 'Bob'.

[Survived] OptionalChaining
app/collaborators/collaborator-details/collaborator-details.component.ts:31:41
   ngOnChanges(changes: SimpleChanges): void {
     const collabChange = changes['collaborator'];
     if (collabChange && collabChange.previousValue &&
-      collabChange.previousValue.id !== collabChange.currentValue?.id
+      collabChange.previousValue.id !== collabChange.currentValue.id
     ) {
       const collaborator: CollaboratorDetails = collabChange.currentValue;

[Killed] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:32:7
     const collabChange = changes['collaborator'];
     if (collabChange && collabChange.previousValue &&
       collabChange.previousValue.id !== collabChange.currentValue?.id
-    ) {
-      const collaborator: CollaboratorDetails = collabChange.currentValue;
-      this.form.patchValue({
-        names: collaborator.names,
-        surnames: collaborator.surnames,
-        email: collaborator.email,
-        periodDateTime: {
-          initDate: this.formatDate(collaborator.periodDateTime._initDate),
-          endDate: this.formatDate(collaborator.periodDateTime._finalDate)
-        }
-      });
-    }
+    ) {}
   }
 
killedBy: CollaboratorDetailsComponent should update form inputs when collaborator input changes
statusReason: Expected 'Alice' to equal 'Bob'.

[Killed] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:46:42
     }
   }
 
-  private formatDate(date: Date): string {
-    return new Date(date).toISOString().split('T')[0];
-  }
+  private formatDate(date: Date): string {}
 
   onSubmit() {
killedBy: CollaboratorDetailsComponent should have in form the values of selected collaborator
statusReason: Expected '' to be '2019-06-10'.

[Timeout] StringLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:47:47
   }
 
   private formatDate(date: Date): string {
-    return new Date(date).toISOString().split('T')[0];
+    return new Date(date).toISOString().split("")[0];
   }
 

[Killed] BlockStatement
app/collaborators/collaborator-details/collaborator-details.component.ts:50:14
     return new Date(date).toISOString().split('T')[0];
   }
 
-  onSubmit() {
-    const formValue = this.form.value;
-
-    const updatedCollaborator: CollaboratorDetails = {
-      id: this.collaborator().id,
-      names: formValue.names,
-      surnames: formValue.surnames,
-      email: formValue.email,
-      periodDateTime: {
-        _initDate: new Date(formValue.periodDateTime.initDate),
-        _finalDate: new Date(formValue.periodDateTime.endDate)
-      }
-    };
-
-    this.changedCollaborator.emit(updatedCollaborator);
-  }
+  onSubmit() {}
 }
killedBy: CollaboratorDetailsComponent should emit updated collaborator when form is submitted

[Killed] ObjectLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:53:54
   onSubmit() {
     const formValue = this.form.value;
 
-    const updatedCollaborator: CollaboratorDetails = {
-      id: this.collaborator().id,
-      names: formValue.names,
-      surnames: formValue.surnames,
-      email: formValue.email,
-      periodDateTime: {
-        _initDate: new Date(formValue.periodDateTime.initDate),
-        _finalDate: new Date(formValue.periodDateTime.endDate)
-      }
-    };
+    const updatedCollaborator: CollaboratorDetails = {};
 
     this.changedCollaborator.emit(updatedCollaborator);
killedBy: CollaboratorDetailsComponent should emit updated collaborator when form is submitted
statusReason: Expected object to have properties
    id: '1'
    names: 'Alice'
    surnames: 'Johnson'
    email: 'alice.johnson@example.com'
    periodDateTime: Object({ _initDate: Date(Mon Jun 10 2019 01:00:00 GMT+0100 (Hora de verão da Europa Ocidental)), _finalDate: Date(Mon Dec 01 2025 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental)) })

[Killed] ObjectLiteral
app/collaborators/collaborator-details/collaborator-details.component.ts:58:23
       names: formValue.names,
       surnames: formValue.surnames,
       email: formValue.email,
-      periodDateTime: {
-        _initDate: new Date(formValue.periodDateTime.initDate),
-        _finalDate: new Date(formValue.periodDateTime.endDate)
-      }
+      periodDateTime: {}
     };
 
killedBy: CollaboratorDetailsComponent should emit updated collaborator when form is submitted
statusReason: Expected $.periodDateTime to have properties
    _initDate: Date(Mon Jun 10 2019 01:00:00 GMT+0100 (Hora de verão da Europa Ocidental))
    _finalDate: Date(Mon Dec 01 2025 00:00:00 GMT+0000 (Hora padrão da Europa Ocidental))
