[Killed] BlockStatement
app/collaborators/collaborator-list/collaborator-list.component.ts:14:58
   collaborators = input.required<CollaboratorDetails[]>();
   selectedCollaborator = output<CollaboratorDetails>();
 
-  onSelectCollaborator(collaborator: CollaboratorDetails){
-    this.selectedCollaborator.emit(collaborator);
-  }
+  onSelectCollaborator(collaborator: CollaboratorDetails){}
 }
 
killedBy: CollaboratorListComponent should emit selectedCollaborator when a button is clicked
