[Survived] ArrowFunction
src/app/collaborators/collaborators.component.ts:16:28
 export class CollaboratorsComponent {
   selectedCollaborator = signal<CollaboratorDetails | undefined>(undefined);
   collaboratorService = inject(CollaboratorService);
-  collaborators = computed(() => this.collaboratorService.getCollaborators());
+  collaborators = computed(() => undefined);
   
   onSelectCollaborator(collaborator: CollaboratorDetails) {

[Killed] BlockStatement
src/app/collaborators/collaborators.component.ts:18:59
   collaboratorService = inject(CollaboratorService);
   collaborators = computed(() => this.collaboratorService.getCollaborators());
   
-  onSelectCollaborator(collaborator: CollaboratorDetails) {
-    this.selectedCollaborator.set(collaborator);
-  }
+  onSelectCollaborator(collaborator: CollaboratorDetails) {}
 
   onChangeCollaborator(updated: CollaboratorDetails) {
killedBy: CollaboratorsComponent should show collaborator details when CollaboratorListComponent emit selectedCollaborator
statusReason: Expected null not to be null.

[Killed] BlockStatement
src/app/collaborators/collaborators.component.ts:22:54
     this.selectedCollaborator.set(collaborator);
   }
 
-  onChangeCollaborator(updated: CollaboratorDetails) {
-    this.collaboratorService.updateCollaborator(updated);
-  }
+  onChangeCollaborator(updated: CollaboratorDetails) {}
 }
 
killedBy: CollaboratorsComponent should update collaborator when CollaboratorDetails emits changedCollaborator
statusReason: Expected spy CollaboratorService.updateCollaborator to have been called only once, and with given args:
But it was never called.


Error: Expected spy CollaboratorService.updateCollaborator to have been called only once, and with given args:
But it was never called.
