[Survived] ArrayDeclaration
src/app/projects/projects.component.ts:13:29
   styleUrl: './projects.component.css'
 })
 export class ProjectsComponent implements OnInit {
-  projectList : Project[] = [];
+  projectList : Project[] = ["Stryker was here"];
   private service = inject(ProjectService);
 

[Survived] BlockStatement
src/app/projects/projects.component.ts:16:20
   projectList : Project[] = [];
   private service = inject(ProjectService);
 
-  ngOnInit(): void {
-    this.service.getProjects().subscribe(data => {
-      this.projectList = data;
-    }
-    );
-  }
+  ngOnInit(): void {}
 }
 

[Survived] BlockStatement
src/app/projects/projects.component.ts:17:50
   private service = inject(ProjectService);
 
   ngOnInit(): void {
-    this.service.getProjects().subscribe(data => {
-      this.projectList = data;
-    }
+    this.service.getProjects().subscribe(data => {}
     );
   }
