[Killed] ObjectLiteral
src/app/app.routes.ts:18:5
         path: 'projects',
         component: ProjectsComponent
     },
-    {
-        path: 'projects/:projectId',
-        component: ProjectDetailsComponent
-    },
+    {},
     {
         path: 'collaborators',
killedBy: AppComponent should create the app; HeaderComponent should create; ProjectsComponent should create
statusReason: Error: NG04014: Invalid configuration of route ''. One of the following must be provided: component, loadComponent, redirectTo, children or loadChildren
error properties: Object({ code: 4014 })

[Killed] ObjectLiteral
src/app/app.routes.ts:22:5
         path: 'projects/:projectId',
         component: ProjectDetailsComponent
     },
-    {
-        path: 'collaborators',
-        component: CollaboratorsComponent
-    },
+    {},
     {
         path: 'collaborators/:collaboratorId',
killedBy: AppComponent should create the app; HeaderComponent should create; ProjectsComponent should create
statusReason: Error: NG04014: Invalid configuration of route ''. One of the following must be provided: component, loadComponent, redirectTo, children or loadChildren
error properties: Object({ code: 4014 })
